{"pos_id": 1, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, e2, f2, g2, h2, d4. Black has pawns on a7, b7, c7, d7, e7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "d4"}
{"pos_id": 2, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, e2, f2, g2, h2, d4. Black has pawns on d5, a7, b7, c7, e7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "d4 d5"}
{"pos_id": 3, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, e2, f2, g2, h2, d4. Black has pawns on d5, a7, b7, c7, e7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "d4 d5 Nc3"}
{"pos_id": 4, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, e2, f2, g2, h2, d4. Black has pawns on d5, a7, b7, c7, e7, f7, g7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "d4 d5 Nc3 Nf6"}
{"pos_id": 5, "position": "", "verbal": "White has rooks on a1, h1; queens on d1; kings on e1; bishops on f1, f4; knights on g1, c3; pawns on a2, b2, c2, e2, f2, g2, h2, d4. Black has pawns on d5, a7, b7, c7, e7, f7, g7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "d4 d5 Nc3 Nf6 Bf4"}
{"pos_id": 6, "position": "", "verbal": "White has rooks on a1, h1; queens on d1; kings on e1; bishops on f1, f4; knights on g1, c3; pawns on a2, b2, c2, e2, f2, g2, h2, d4. Black has pawns on c5, d5, a7, b7, e7, f7, g7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "d4 d5 Nc3 Nf6 Bf4 c5"}
{"pos_id": 7, "position": "", "verbal": "White has rooks on a1, h1; queens on d1; kings on e1; bishops on f1, f4; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, d4, e4. Black has pawns on c5, d5, a7, b7, e7, f7, g7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "d4 d5 Nc3 Nf6 Bf4 c5 e4"}
{"pos_id": 8, "position": "", "verbal": "White has rooks on a1, h1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, e6; queens on d4; bishops on f4. Black has pawns on d5, f6, a7, b7, e7, g7, h7; bishops on c6, f8; rooks on a8, h8; queens on d8; kings on e8; knights on g8. false.", "move_history_copy": "d4 d5 Nc3 Nf6 Bf4 c5 e4 cxd4 Qxd4 Nc6 Bb5 Bd7 Bxc6 Bxc6 e5 Ng8 e6 f6"}
{"pos_id": 9, "position": "", "verbal": "White has kings on c1; rooks on d1, h1; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, e6; queens on d4; bishops on f4. Black has pawns on d5, f6, a7, b7, e7, g7, h7; bishops on c6, f8; rooks on a8, h8; queens on d8; kings on e8; knights on g8. true.", "move_history_copy": "d4 d5 Nc3 Nf6 Bf4 c5 e4 cxd4 Qxd4 Nc6 Bb5 Bd7 Bxc6 Bxc6 e5 Ng8 e6 f6 O-O-O"}
{"pos_id": 10, "position": "", "verbal": "White has kings on c1; rooks on d1, h1; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, e6; bishops on g3; queens on d4. Black has pawns on d5, g5, f6, a7, b7, e7, h7; bishops on c6, f8; rooks on a8, h8; queens on d8; kings on e8; knights on g8. true.", "move_history_copy": "d4 d5 Nc3 Nf6 Bf4 c5 e4 cxd4 Qxd4 Nc6 Bb5 Bd7 Bxc6 Bxc6 e5 Ng8 e6 f6 O-O-O g5 Bg3"}
{"pos_id": 11, "position": "", "verbal": "White has kings on c1; rooks on d1, h1; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, e6; bishops on g3; queens on d4. Black has pawns on d5, g5, f6, a7, b7, e7, h7; bishops on c6, f8; knights on h6; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "d4 d5 Nc3 Nf6 Bf4 c5 e4 cxd4 Qxd4 Nc6 Bb5 Bd7 Bxc6 Bxc6 e5 Ng8 e6 f6 O-O-O g5 Bg3 Nh6"}
{"pos_id": 12, "position": "", "verbal": "White has kings on c1; rooks on h1; pawns on a2, b2, c2, f2, g2, h2, e6; queens on d3; knights on f3; bishops on c7. Black has knights on f5; pawns on g5, h5, f6, a7, b7, e7; bishops on c6, f8; rooks on c8, h8; kings on e8. true.", "move_history_copy": "d4 d5 Nc3 Nf6 Bf4 c5 e4 cxd4 Qxd4 Nc6 Bb5 Bd7 Bxc6 Bxc6 e5 Ng8 e6 f6 O-O-O g5 Bg3 Nh6 Nxd5 Bxd5 Qa4+ Bc6 Rxd8+ Rxd8 Qb3 Nf5 Nf3 h5 Bc7 Rc8 Qd3"}
{"pos_id": 13, "position": "", "verbal": "White has kings on c1; pawns on a2, b2, c2, f2, g2, h2, e6; knights on f3; queens on f6. Black has pawns on g5, h5, d6, a7, b7; bishops on c6, f8; rooks on c7, h8; kings on d8. true.", "move_history_copy": "d4 d5 Nc3 Nf6 Bf4 c5 e4 cxd4 Qxd4 Nc6 Bb5 Bd7 Bxc6 Bxc6 e5 Ng8 e6 f6 O-O-O g5 Bg3 Nh6 Nxd5 Bxd5 Qa4+ Bc6 Rxd8+ Rxd8 Qb3 Nf5 Nf3 h5 Bc7 Rc8 Qd3 Rxc7 Rd1 Nd6 Qg6+ Kd8 Rxd6+ exd6 Qxf6+"}
{"pos_id": 14, "position": "", "verbal": "White has kings on c1; pawns on a2, b2, c2, f2, g2, h2, e6; knights on f3; queens on h8. Black has pawns on g5, h5, d6, a7, b7; bishops on c6, f8; rooks on g7; kings on e8. false.", "move_history_copy": "d4 d5 Nc3 Nf6 Bf4 c5 e4 cxd4 Qxd4 Nc6 Bb5 Bd7 Bxc6 Bxc6 e5 Ng8 e6 f6 O-O-O g5 Bg3 Nh6 Nxd5 Bxd5 Qa4+ Bc6 Rxd8+ Rxd8 Qb3 Nf5 Nf3 h5 Bc7 Rc8 Qd3 Rxc7 Rd1 Nd6 Qg6+ Kd8 Rxd6+ exd6 Qxf6+ Ke8 Qxh8 Rg7"}
{"pos_id": 15, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, d2, f2, g2, h2, e4. Black has pawns on a7, b7, c7, d7, e7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4"}
{"pos_id": 16, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, d2, f2, g2, h2, e4. Black has pawns on c5, a7, b7, d7, e7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 c5"}
{"pos_id": 17, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, d2, f2, g2, h2, c3, e4. Black has pawns on c5, a7, b7, d7, e7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 c5 c3"}
{"pos_id": 18, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, d2, f2, g2, h2, c3, e5. Black has pawns on c5, d5, a7, b7, e7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 c5 c3 d5 e5"}
{"pos_id": 19, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, d2, f2, g2, h2, c3, e5. Black has pawns on d4, c5, a7, b7, e7, f7, g7, h7; knights on c6, g8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6"}
{"pos_id": 20, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, b5; queens on d1; kings on e1; pawns on a2, b2, d2, f2, g2, h2, c3, e5. Black has pawns on d4, c5, a7, b7, e7, f7, g7, h7; knights on c6, g8; bishops on d7, f8; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7"}
{"pos_id": 21, "position": "", "verbal": "White has rooks on a1, f1; knights on b1, f3; bishops on c1; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2, c3. Black has pawns on d4, c5, a7, b7, e7, f7, g7, h7; knights on d7, g8; rooks on a8, h8; queens on d8; kings on e8; bishops on f8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7"}
{"pos_id": 22, "position": "", "verbal": "White has rooks on a1, f1; knights on b1, f3; bishops on c1; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2. Black has pawns on d4, a7, b7, e7, f7, g7, h7; knights on d7, g8; rooks on a8, h8; queens on d8; kings on e8; bishops on f8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4"}
{"pos_id": 23, "position": "", "verbal": "White has rooks on a1, f1; knights on b1, d4; bishops on c1; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2. Black has pawns on a7, b7, e7, f7, g7, h7; knights on d7, g8; rooks on a8, h8; queens on d8; kings on e8; bishops on f8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4"}
{"pos_id": 24, "position": "", "verbal": "White has rooks on a1, f1; knights on b1, d4; bishops on c1; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2. Black has knights on f6, d7; pawns on a7, b7, e7, f7, g7, h7; rooks on a8, h8; queens on d8; kings on e8; bishops on f8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6"}
{"pos_id": 25, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2; knights on c3, d4. Black has knights on f6, d7; pawns on a7, b7, e7, f7, g7, h7; rooks on a8, h8; queens on d8; kings on e8; bishops on f8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3"}
{"pos_id": 26, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2; knights on c3, d4. Black has pawns on e6, a7, b7, f7, g7, h7; knights on f6, d7; rooks on a8, h8; queens on d8; kings on e8; bishops on f8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6"}
{"pos_id": 27, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2; knights on c3, f3. Black has pawns on e6, a7, b7, f7, g7, h7; knights on f6, d7; rooks on a8, h8; queens on d8; kings on e8; bishops on f8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3"}
{"pos_id": 28, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1; queens on d1; kings on g1; pawns on a2, b2, f2, g2, h2, d4; knights on c3, f3. Black has knights on c5, f6; pawns on e6, a7, b7, f7, g7, h7; rooks on a8, h8; queens on d8; kings on e8; bishops on f8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4"}
{"pos_id": 29, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1; kings on g1; pawns on a2, f2, g2, h2, c3, d4; queens on b3; knights on f3. Black has pawns on e6, a7, b7, f7, g7, h7; knights on f6; rooks on a8, h8; queens on d8; kings on e8; bishops on f8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3"}
{"pos_id": 30, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1; kings on g1; pawns on a2, f2, g2, h2, c3, d4; queens on b3; knights on f3. Black has pawns on b6, e6, a7, f7, g7, h7; knights on f6; rooks on a8, h8; queens on d8; kings on e8; bishops on f8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6"}
{"pos_id": 31, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1; kings on g1; pawns on a2, f2, g2, h2, c3, d4; queens on b3; knights on e5. Black has pawns on b6, e6, a7, f7, g7, h7; knights on f6; rooks on a8, h8; queens on d8; kings on e8; bishops on f8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5"}
{"pos_id": 32, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1; kings on g1; pawns on a2, f2, g2, h2, c3, d4; queens on b3; knights on e5. Black has pawns on b6, e6, a7, f7, g7, h7; bishops on d6; knights on f6; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6"}
{"pos_id": 33, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1; kings on g1; pawns on a2, f2, g2, h2, c3, d4; queens on b4; knights on e5. Black has pawns on b6, e6, a7, f7, g7, h7; bishops on d6; knights on f6; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O"}
{"pos_id": 34, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1; kings on g1; pawns on a2, f2, g2, h2, c3, d4; queens on b3; knights on e5. Black has pawns on b6, e6, a7, f7, g7, h7; bishops on d6; knights on f6; rooks on c8, f8; queens on d8; kings on g8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8"}
{"pos_id": 35, "position": "", "verbal": "White has rooks on a1, f1; kings on g1; pawns on a2, f2, g2, h2, c3, d4; queens on a3; knights on e5. Black has pawns on b6, e6, a7, f7, g7, h7; knights on f6; rooks on c8, f8; queens on d8; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3"}
{"pos_id": 36, "position": "", "verbal": "White has rooks on a1, f1; kings on g1; pawns on a2, f2, g2, h2, c3, d4; queens on a3; knights on e5. Black has pawns on b6, e6, a7, f7, g7, h7; knights on f6; queens on c7; rooks on c8, f8; kings on g8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7"}
{"pos_id": 37, "position": "", "verbal": "White has rooks on a1, f1; kings on g1; pawns on a2, f2, g2, h2, c4, d4; queens on a3; knights on e5. Black has pawns on b6, e6, a7, f7, g7, h7; knights on f6; queens on c7; rooks on c8, f8; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4"}
{"pos_id": 38, "position": "", "verbal": "White has rooks on a1, f1; kings on g1; pawns on a2, f2, g2, h2, c4, d4; queens on a3; knights on e5. Black has pawns on b6, e6, a7, f7, g7, h7; knights on f6; queens on c7; rooks on c8, d8; kings on g8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8"}
{"pos_id": 39, "position": "", "verbal": "White has rooks on a1, d1; kings on g1; pawns on a2, f2, g2, h2, c4, d4; queens on a3; knights on e5. Black has pawns on b6, e6, a7, f7, g7, h7; knights on f6; queens on c7; rooks on c8, d8; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1"}
{"pos_id": 40, "position": "", "verbal": "White has rooks on c1, d1; kings on g1; pawns on a2, f2, g2, h2, c4, d4; queens on a3; knights on e5. Black has knights on e4; pawns on b6, e6, a7, f7, g7, h7; queens on c7; rooks on c8, d8; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1"}
{"pos_id": 41, "position": "", "verbal": "White has rooks on c1, d1; kings on g1; pawns on a2, f2, g2, h3, c4, d4; queens on a3; knights on e5. Black has pawns on b6, e6, a7, f7, g7, h7; knights on d6; queens on c7; rooks on c8, d8; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3"}
{"pos_id": 42, "position": "", "verbal": "White has rooks on c1, d1; kings on g1; pawns on f2, g2, h3, a4, d4; queens on b3; knights on f3. Black has knights on c4; pawns on a6, b6, e6, f6, g7, h7; queens on c7; rooks on c8, d8; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4"}
{"pos_id": 43, "position": "", "verbal": "White has rooks on c1, d1; kings on g1; pawns on f2, g2, h3, a4, d4; queens on b3; knights on f3. Black has knights on c4; pawns on a6, b6, e6, f6, g7, h7; queens on c6; rooks on c8, d8; kings on g8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6"}
{"pos_id": 44, "position": "", "verbal": "White has rooks on c1, e1; kings on g1; pawns on f2, g2, h3, a4, d4; queens on b3; knights on f3. Black has knights on c4; pawns on a6, b6, e6, f6, g7, h7; queens on c6; rooks on c8, d8; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1"}
{"pos_id": 45, "position": "", "verbal": "White has rooks on c1, e1; kings on g1; pawns on f2, g2, h3, a4, d4; queens on b3; knights on f3. Black has knights on c4; pawns on b5, a6, e6, f6, g7, h7; queens on c6; rooks on c8, d8; kings on g8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5"}
{"pos_id": 46, "position": "", "verbal": "White has rooks on c1, e1; kings on g1; pawns on f2, g2, h3, d4; queens on b3; knights on f3. Black has knights on c4; pawns on b5, e6, f6, g7, h7; queens on c6; rooks on c8, d8; kings on g8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5"}
{"pos_id": 47, "position": "", "verbal": "White has rooks on b1, e1; kings on g1; pawns on f2, g2, h3, d4; queens on b3; knights on f3. Black has knights on c4; pawns on b5, e6, f6, g7, h7; queens on c6; rooks on c8, d8; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1"}
{"pos_id": 48, "position": "", "verbal": "White has rooks on b1, e1; kings on g1; pawns on f2, g2, h3, d4; queens on b3; knights on f3. Black has knights on c4; pawns on b5, e6, f6, g7, h7; rooks on d5, c8; queens on c6; kings on g8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5"}
{"pos_id": 49, "position": "", "verbal": "White has rooks on b1, e2; kings on g1; pawns on f2, g2, h3, d4; queens on b3; knights on f3. Black has knights on c4; pawns on b5, e6, f6, g7, h7; rooks on d5, c8; queens on c6; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2"}
{"pos_id": 50, "position": "", "verbal": "White has rooks on b1, e2; kings on g1; pawns on f2, g2, h3, d4; queens on b3; knights on f3. Black has knights on c4; pawns on b5, e6, f6, g7, h7; rooks on d5, c8; queens on d7; kings on g8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7"}
{"pos_id": 51, "position": "", "verbal": "White has rooks on b1, e2; kings on g1; queens on a2; pawns on f2, g2, h3, d4; knights on f3. Black has knights on c4; pawns on b5, e6, f6, g7, h7; rooks on d5, c8; queens on d7; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2"}
{"pos_id": 52, "position": "", "verbal": "White has rooks on b1, e2; kings on g1; queens on a2; pawns on f2, g2, h3, d4; knights on f3. Black has knights on c4; pawns on b5, e6, f6, h6, g7; rooks on d5, c8; queens on d7; kings on g8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6"}
{"pos_id": 53, "position": "", "verbal": "White has rooks on b1, e2; kings on g1; pawns on f2, g2, h3, d4; knights on f3; queens on a6. Black has knights on c4; pawns on b5, e6, f6, h6, g7; rooks on d5, c8; queens on d7; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6"}
{"pos_id": 54, "position": "", "verbal": "White has rooks on b1, e2; kings on g1; queens on a2; pawns on f2, g2, h3, d4; knights on f3. Black has knights on c4; pawns on b5, e6, f6, h6, g7; rooks on d5, c6; queens on d7; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2"}
{"pos_id": 55, "position": "", "verbal": "White has rooks on b1, e2; kings on g1; queens on a2; pawns on f2, g2, h3, d4; knights on f3. Black has knights on c4; pawns on b5, e6, f6, h6, g7; rooks on d5, c6; queens on d7; kings on h7. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7"}
{"pos_id": 56, "position": "", "verbal": "White has rooks on b1, e2; kings on g1; queens on c2; pawns on f2, g2, h3, d4; knights on f3. Black has knights on c4; pawns on b5, f5, e6, h6, g7; rooks on d5, c6; queens on d7; kings on h7. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5"}
{"pos_id": 57, "position": "", "verbal": "White has rooks on b1, e2; kings on g1; pawns on f2, g2, h3, d4; queens on b3; knights on f3. Black has knights on c4; pawns on b5, f5, e6, h6, g7; rooks on d5, c6; queens on d7; kings on h7. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3"}
{"pos_id": 58, "position": "", "verbal": "White has rooks on b1, e2; kings on g1; pawns on f2, g2, h3, d4; queens on b3; knights on f3. Black has knights on c4; pawns on b5, f5, e6, h6, g7; rooks on d5, d6; queens on d7; kings on h7. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6"}
{"pos_id": 59, "position": "", "verbal": "White has rooks on b1, e2; kings on g1; pawns on f2, g2, h3, d4; knights on f3; queens on b4. Black has knights on c4; pawns on b5, f5, e6, h6, g7; rooks on d5, d6; queens on d7; kings on h7. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4"}
{"pos_id": 60, "position": "", "verbal": "White has rooks on b1, e2; kings on g1; pawns on f2, g2, h3, d4; knights on f3; queens on b4. Black has knights on c4; pawns on b5, f5, e6, h6, g7; rooks on d5, d6; queens on f7; kings on h7. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7"}
{"pos_id": 61, "position": "", "verbal": "White has rooks on e1, e2; kings on g1; pawns on f2, g2, h3, d4; knights on f3; queens on b4. Black has knights on c4; pawns on b5, f5, e6, h6, g7; rooks on d5, d6; queens on f7; kings on h7. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7 Rbe1"}
{"pos_id": 62, "position": "", "verbal": "White has rooks on e1, e2; kings on g1; pawns on f2, g2, h3, d4; knights on f3; queens on b4. Black has knights on c4; pawns on b5, f5, e6, h6, g7; rooks on d5, d6; queens on d7; kings on h7. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7 Rbe1 Qd7"}
{"pos_id": 63, "position": "", "verbal": "White has rooks on e1, e2; kings on g1; pawns on f2, g2, h3, d4; queens on b3; knights on f3. Black has knights on c4; pawns on b5, f5, e6, h6, g7; rooks on d5, a6; queens on d7; kings on h7. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7 Rbe1 Qd7 Qb3 Ra6"}
{"pos_id": 64, "position": "", "verbal": "White has rooks on e1, e2; kings on g1; pawns on f2, g2, h3, d4; queens on c3; knights on f3. Black has knights on c4; pawns on b5, f5, e6, h6, g7; rooks on d5, a6; queens on d7; kings on h7. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7 Rbe1 Qd7 Qb3 Ra6 Qc3"}
{"pos_id": 65, "position": "", "verbal": "White has rooks on e1, e2; kings on g1; pawns on f2, g2, h3, d4; knights on f3; queens on b4. Black has knights on c4; pawns on b5, f5, e6, h6, g7; rooks on d5, a6; queens on d7; kings on h7. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7 Rbe1 Qd7 Qb3 Ra6 Qc3 Ra3 Qb4 Ra6"}
{"pos_id": 66, "position": "", "verbal": "White has rooks on e1, e2; kings on g1; pawns on f2, g2, h3, d4; queens on c3; knights on f3. Black has knights on c4; pawns on b5, f5, e6, h6, g7; rooks on d5, a6; queens on d7; kings on h7. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7 Rbe1 Qd7 Qb3 Ra6 Qc3 Ra3 Qb4 Ra6 Qc3"}
{"pos_id": 67, "position": "", "verbal": "White has rooks on c1, c2; kings on g1; pawns on f2, g2, h3, d4; knights on e5; queens on g6. Black has knights on e4; pawns on b5, f5, e6, h6, g7; rooks on d5, a8; queens on f6; kings on g8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7 Rbe1 Qd7 Qb3 Ra6 Qc3 Ra3 Qb4 Ra6 Qc3 Nd6 Ne5 Qe7 Qg3 Ne4 Qg6+ Kg8 Rc2 Ra8 Rec1 Qf6"}
{"pos_id": 68, "position": "", "verbal": "White has rooks on c1, c8; kings on g1; pawns on f2, g2, h3, d4; knights on e5; queens on g6. Black has knights on e4; pawns on b5, f5, e6, h6, g7; queens on f6; rooks on a8, d8; kings on g8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7 Rbe1 Qd7 Qb3 Ra6 Qc3 Ra3 Qb4 Ra6 Qc3 Nd6 Ne5 Qe7 Qg3 Ne4 Qg6+ Kg8 Rc2 Ra8 Rec1 Qf6 Rc8+ Rd8"}
{"pos_id": 69, "position": "", "verbal": "White has rooks on c1; kings on g1; pawns on f2, g2, h3, d4; knights on c6. Black has knights on e4; pawns on b5, f5, e6, f6, h6; rooks on a8; kings on g8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7 Rbe1 Qd7 Qb3 Ra6 Qc3 Ra3 Qb4 Ra6 Qc3 Nd6 Ne5 Qe7 Qg3 Ne4 Qg6+ Kg8 Rc2 Ra8 Rec1 Qf6 Rc8+ Rd8 Rxa8 Rxa8 Qxf6 gxf6 Nc6"}
{"pos_id": 70, "position": "", "verbal": "White has rooks on c1; kings on g1; pawns on f2, g2, h3, d4; knights on b4. Black has knights on e4; pawns on b5, f5, e6, f6, h6; kings on f7; rooks on a8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7 Rbe1 Qd7 Qb3 Ra6 Qc3 Ra3 Qb4 Ra6 Qc3 Nd6 Ne5 Qe7 Qg3 Ne4 Qg6+ Kg8 Rc2 Ra8 Rec1 Qf6 Rc8+ Rd8 Rxa8 Rxa8 Qxf6 gxf6 Nc6 Kf7 Nb4"}
{"pos_id": 71, "position": "", "verbal": "White has rooks on c1; kings on g1; pawns on f2, g2, h3, d4; knights on b4. Black has knights on e4; pawns on b5, f5, e6, f6, h6; kings on f7; rooks on d8. false.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7 Rbe1 Qd7 Qb3 Ra6 Qc3 Ra3 Qb4 Ra6 Qc3 Nd6 Ne5 Qe7 Qg3 Ne4 Qg6+ Kg8 Rc2 Ra8 Rec1 Qf6 Rc8+ Rd8 Rxa8 Rxa8 Qxf6 gxf6 Nc6 Kf7 Nb4 Rd8"}
{"pos_id": 72, "position": "", "verbal": "White has kings on g1; pawns on f2, g2, h3, d4; knights on b4; rooks on c7. Black has knights on e4; pawns on b5, f5, e6, f6, h6; kings on f7; rooks on d8. true.", "move_history_copy": "e4 c5 c3 d5 e5 d4 Nf3 Nc6 Bb5 Bd7 O-O Nxe5 Bxd7+ Nxd7 cxd4 cxd4 Nxd4 Ngf6 Nc3 e6 Nf3 Nc5 d4 Nce4 Qb3 Nxc3 bxc3 b6 Ne5 Bd6 Qb4 O-O Qb3 Rc8 Ba3 Bxa3 Qxa3 Qc7 c4 Rfd8 Rfd1 Ne4 Rac1 Nd6 h3 f6 Nf3 Nxc4 Qb3 a6 a4 Qc6 Re1 b5 axb5 axb5 Rb1 Rd5 Re2 Qd7 Qa2 h6 Qa6 Rc6 Qa2 Kh7 Qc2+ f5 Qb3 Rcd6 Qb4 Qf7 Rbe1 Qd7 Qb3 Ra6 Qc3 Ra3 Qb4 Ra6 Qc3 Nd6 Ne5 Qe7 Qg3 Ne4 Qg6+ Kg8 Rc2 Ra8 Rec1 Qf6 Rc8+ Rd8 Rxa8 Rxa8 Qxf6 gxf6 Nc6 Kf7 Nb4 Rd8 Rc7+"}
{"pos_id": 74, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, e2, f2, g2, h2, d4. Black has pawns on d6, a7, b7, c7, e7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "d4 d6"}
{"pos_id": 75, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, e2, f2, g2, h2, d4. Black has pawns on d6, a7, b7, c7, e7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "d4 d6 Nc3"}
{"pos_id": 76, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, e2, f2, g2, h2, d4. Black has pawns on d6, g6, a7, b7, c7, e7, f7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "d4 d6 Nc3 g6"}
{"pos_id": 77, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, d4, e4. Black has pawns on d6, g6, a7, b7, c7, e7, f7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4"}
{"pos_id": 78, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, d4, e4. Black has pawns on d6, g6, a7, b7, c7, e7, f7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6"}
{"pos_id": 79, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, g2, h2, d4, e4, f4. Black has pawns on d6, g6, a7, b7, c7, e7, f7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4"}
{"pos_id": 80, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, g2, h2, d4, e4, f4. Black has pawns on d6, g6, a7, b7, c7, e7, f7, h7; knights on f6, b8; bishops on g7, c8; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7"}
{"pos_id": 81, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, d3; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, g2, h2, d4, e4, f4. Black has pawns on d6, g6, a7, b7, c7, e7, f7, h7; knights on f6, b8; bishops on g7, c8; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3"}
{"pos_id": 82, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, d3; queens on d1; kings on e1; pawns on a2, b2, c2, g2, h2, d4, e4, f4; knights on c3, f3. Black has pawns on d6, g6, a7, b7, c7, e7, f7, h7; knights on f6, b8; bishops on g7, c8; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3"}
{"pos_id": 83, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1, d3; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2, e4, f4; knights on c3, f3. Black has pawns on e5, g6, a7, b7, c7, f7, h7; knights on f6, b8; bishops on g7, c8; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O"}
{"pos_id": 84, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2, e4; knights on c3, f3; bishops on d3, f4. Black has knights on f6, b8; pawns on g6, a7, b7, c7, f7, h7; bishops on g7, c8; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4"}
{"pos_id": 85, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2, e4; knights on c3, f3; bishops on d3, f4. Black has knights on c6, f6; pawns on g6, a7, b7, c7, f7, h7; bishops on g7, c8; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6"}
{"pos_id": 86, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2, e4; knights on c3, f3; bishops on d3, g5. Black has knights on c6, f6; pawns on g6, a7, b7, c7, f7, h7; bishops on g7, c8; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5"}
{"pos_id": 87, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2, e4; knights on c3, f3; bishops on d3, g5. Black has knights on c6, f6; pawns on g6, h6, a7, b7, c7, f7; bishops on g7, c8; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6"}
{"pos_id": 88, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2, e4; knights on c3, f3; bishops on d3, h4. Black has knights on c6, f6; pawns on g6, h6, a7, b7, c7, f7; bishops on g7, c8; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4"}
{"pos_id": 89, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2, e4; knights on c3, f3; bishops on d3, h4. Black has pawns on g5, h6, a7, b7, c7, f7; knights on c6, f6; bishops on g7, c8; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5"}
{"pos_id": 90, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2, e4; knights on c3, f3; bishops on d3, g3. Black has pawns on g5, h6, a7, b7, c7, f7; knights on c6, f6; bishops on g7, c8; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3"}
{"pos_id": 91, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2, e4; knights on c3, f3; bishops on d3, g3. Black has pawns on g5, h6, a7, b7, c7, f7; knights on h5, c6; bishops on g7, c8; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3 Nh5"}
{"pos_id": 92, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2, e4; bishops on f2, d3; knights on c3, f3. Black has pawns on g5, h6, a7, b7, c7, f7; knights on h5, c6; bishops on g7, c8; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3 Nh5 Bf2"}
{"pos_id": 93, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2, f5; bishops on f2, d3; knights on c3. Black has pawns on g4, h6, a7, b7, c7, f7; knights on e5, h5; bishops on g7; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3 Nh5 Bf2 g4 Nh4 Ne5 Nf5 Bxf5 exf5"}
{"pos_id": 94, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2; bishops on d3, c5; knights on e4. Black has pawns on g4, h6, a7, b7, c7, f7; knights on e5, h5; queens on f5; bishops on g7; rooks on a8, f8; kings on g8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3 Nh5 Bf2 g4 Nh4 Ne5 Nf5 Bxf5 exf5 Qg5 Ne4 Qxf5 Bc5"}
{"pos_id": 95, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, g2, h2; bishops on d3; knights on e4. Black has pawns on g4, h6, a7, b7, c7, f7; knights on e5, h5; queens on e6; bishops on g7; rooks on f8; kings on g8. false.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3 Nh5 Bf2 g4 Nh4 Ne5 Nf5 Bxf5 exf5 Qg5 Ne4 Qxf5 Bc5 Qe6 Bxf8 Rxf8"}
{"pos_id": 96, "position": "", "verbal": "White has rooks on a1, f1; kings on g1; pawns on a2, b2, c2, g2, h2; queens on e2; bishops on d3; knights on e4. Black has pawns on g4, h6, a7, b7, c7, f7; knights on e5, h5; queens on e6; bishops on g7; rooks on f8; kings on g8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3 Nh5 Bf2 g4 Nh4 Ne5 Nf5 Bxf5 exf5 Qg5 Ne4 Qxf5 Bc5 Qe6 Bxf8 Rxf8 Qe2"}
{"pos_id": 97, "position": "", "verbal": "White has rooks on e1, f1; kings on h1; pawns on a2, b2, g2, h2, d3; knights on c4; queens on e4. Black has pawns on f4, g4, h6, a7, b7, c7; queens on g5; knights on h5; bishops on g7; kings on h7; rooks on f8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3 Nh5 Bf2 g4 Nh4 Ne5 Nf5 Bxf5 exf5 Qg5 Ne4 Qxf5 Bc5 Qe6 Bxf8 Rxf8 Qe2 f5 Nd2 Qb6+ Kh1 Qg6 Rae1 Qg5 Nc4 Nxd3 cxd3 Kh7 Qe3 f4 Qe4+"}
{"pos_id": 98, "position": "", "verbal": "White has rooks on e1, f1; kings on h1; pawns on a2, b2, g2, h2, d3; queens on e4; knights on e5. Black has pawns on f4, g4, h6, a7, b7, c7; queens on g5; knights on h5; bishops on g7; rooks on f8; kings on g8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3 Nh5 Bf2 g4 Nh4 Ne5 Nf5 Bxf5 exf5 Qg5 Ne4 Qxf5 Bc5 Qe6 Bxf8 Rxf8 Qe2 f5 Nd2 Qb6+ Kh1 Qg6 Rae1 Qg5 Nc4 Nxd3 cxd3 Kh7 Qe3 f4 Qe4+ Kg8 Ne5"}
{"pos_id": 99, "position": "", "verbal": "White has rooks on e1, f1; kings on h1; pawns on a2, b2, g2, h2, d3; queens on e4; knights on e5. Black has pawns on f4, g4, h6, a7, b7, c7; queens on g5; knights on h5; bishops on g7; rooks on e8; kings on g8. false.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3 Nh5 Bf2 g4 Nh4 Ne5 Nf5 Bxf5 exf5 Qg5 Ne4 Qxf5 Bc5 Qe6 Bxf8 Rxf8 Qe2 f5 Nd2 Qb6+ Kh1 Qg6 Rae1 Qg5 Nc4 Nxd3 cxd3 Kh7 Qe3 f4 Qe4+ Kg8 Ne5 Re8"}
{"pos_id": 100, "position": "", "verbal": "White has rooks on e1, f1; kings on h1; pawns on a2, b2, g2, h2, d4; queens on c4; knights on e5. Black has pawns on f4, g4, c6, h6, a7, b7; queens on g5; knights on h5; bishops on g7; kings on h7; rooks on e8. false.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3 Nh5 Bf2 g4 Nh4 Ne5 Nf5 Bxf5 exf5 Qg5 Ne4 Qxf5 Bc5 Qe6 Bxf8 Rxf8 Qe2 f5 Nd2 Qb6+ Kh1 Qg6 Rae1 Qg5 Nc4 Nxd3 cxd3 Kh7 Qe3 f4 Qe4+ Kg8 Ne5 Re8 Qd5+ Kh7 Qe4+ Kg8 Qc4+ Kh7 d4 c6"}
{"pos_id": 101, "position": "", "verbal": "White has rooks on e1, f1; kings on h1; pawns on a2, b2, g2, h2, d4; queens on b3; knights on e5. Black has pawns on f4, g4, c6, h6, a7, b7; queens on g5; knights on h5; bishops on g7; kings on h7; rooks on e8. false.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3 Nh5 Bf2 g4 Nh4 Ne5 Nf5 Bxf5 exf5 Qg5 Ne4 Qxf5 Bc5 Qe6 Bxf8 Rxf8 Qe2 f5 Nd2 Qb6+ Kh1 Qg6 Rae1 Qg5 Nc4 Nxd3 cxd3 Kh7 Qe3 f4 Qe4+ Kg8 Ne5 Re8 Qd5+ Kh7 Qe4+ Kg8 Qc4+ Kh7 d4 c6 Qd3+ Kg8 Qb3+ Kh7"}
{"pos_id": 102, "position": "", "verbal": "White has rooks on e1, f1; kings on h1; pawns on a2, b2, g2, h2, d4; queens on c4; knights on f7. Black has pawns on f4, g4, c6, h6, a7, b7; queens on g5; knights on h5; bishops on g7; kings on h7; rooks on e8. true.", "move_history_copy": "d4 d6 Nc3 g6 e4 Nf6 f4 Bg7 Bd3 O-O Nf3 e5 dxe5 dxe5 O-O exf4 Bxf4 Nc6 Bg5 h6 Bh4 g5 Bg3 Nh5 Bf2 g4 Nh4 Ne5 Nf5 Bxf5 exf5 Qg5 Ne4 Qxf5 Bc5 Qe6 Bxf8 Rxf8 Qe2 f5 Nd2 Qb6+ Kh1 Qg6 Rae1 Qg5 Nc4 Nxd3 cxd3 Kh7 Qe3 f4 Qe4+ Kg8 Ne5 Re8 Qd5+ Kh7 Qe4+ Kg8 Qc4+ Kh7 d4 c6 Qd3+ Kg8 Qb3+ Kh7 Qc2+ Kg8 Qc4+ Kh7 Nf7"}
{"pos_id": 106, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c3, d4, e4. Black has pawns on c5, d5, e6, a7, b7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5"}
{"pos_id": 107, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c3, d4, e5. Black has pawns on c5, d5, e6, a7, b7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5"}
{"pos_id": 108, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c3, d4, e5. Black has pawns on c5, d5, e6, a7, b7, f7, g7, h7; queens on b6; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; kings on e8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6"}
{"pos_id": 109, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c3, d4, e5. Black has pawns on c5, d5, e6, a7, b7, f7, g7, h7; queens on b6; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; kings on e8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3"}
{"pos_id": 110, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c3, d4, e5. Black has pawns on c5, d5, e6, a7, b7, f7, g7, h7; queens on b6; bishops on d7, f8; rooks on a8, h8; knights on b8, g8; kings on e8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7"}
{"pos_id": 111, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, d3; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c3, d4, e5. Black has pawns on c5, d5, e6, a7, b7, f7, g7, h7; queens on b6; bishops on d7, f8; rooks on a8, h8; knights on b8, g8; kings on e8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3"}
{"pos_id": 112, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, d3; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c3, d4, e5. Black has bishops on b5, f8; pawns on c5, d5, e6, a7, b7, f7, g7, h7; queens on b6; rooks on a8, h8; knights on b8, g8; kings on e8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5"}
{"pos_id": 113, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1; pawns on a2, g2, h2, c3, b4, e5; kings on e2; queens on d3. Black has bishops on f2; pawns on d5, e6, a7, b7, f7, g7, h7; queens on b6; rooks on a8, h8; knights on b8, g8; kings on e8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3"}
{"pos_id": 114, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1; pawns on a2, g2, h2, c3, b4, e5; kings on e2; queens on d3. Black has bishops on f2; pawns on d5, e6, a7, b7, f7, g7, h7; queens on b6; knights on h6, b8; rooks on a8, h8; kings on e8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6"}
{"pos_id": 115, "position": "", "verbal": "White has rooks on a1, f1; knights on b1, f3; bishops on c1; pawns on a2, g2, h2, c3, b4, e5; kings on e2; queens on d3. Black has bishops on f2; pawns on d5, e6, a7, b7, f7, g7, h7; queens on b6; knights on h6, b8; rooks on a8, h8; kings on e8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1"}
{"pos_id": 116, "position": "", "verbal": "White has rooks on a1, f2; knights on b1; bishops on c1; pawns on a2, g2, c3, b4, e5; kings on e2; queens on f3. Black has pawns on d5, e6, a7, b7, f7, g7; queens on b6; rooks on a8, h8; knights on b8; kings on e8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3"}
{"pos_id": 117, "position": "", "verbal": "White has rooks on a1, f2; knights on b1; bishops on c1; pawns on a2, g2, c3, b4, e5; kings on e2; queens on f3. Black has queens on b5; pawns on d5, e6, a7, b7, f7, g7; rooks on a8, h8; knights on b8; kings on e8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+"}
{"pos_id": 118, "position": "", "verbal": "White has rooks on a1, f2; knights on b1; bishops on c1; pawns on a2, g2, c3, b4, e5; kings on d2; queens on f3. Black has queens on b5; pawns on d5, e6, a7, b7, f7, g7; rooks on a8, f8; knights on b8; kings on g8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O"}
{"pos_id": 119, "position": "", "verbal": "White has rooks on a1, f2; knights on b1; bishops on c1; kings on d2; pawns on g2, c3, a4, b4, e5; queens on f3. Black has queens on b5; pawns on d5, e6, a7, b7, f7, g7; rooks on a8, f8; knights on b8; kings on g8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4"}
{"pos_id": 120, "position": "", "verbal": "White has rooks on a1, f2; knights on b1; bishops on c1; kings on d2; pawns on g2, c3, a4, b4, e5; queens on f3. Black has queens on c4; pawns on d5, e6, a7, b7, f7, g7; rooks on a8, f8; knights on b8; kings on g8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4"}
{"pos_id": 121, "position": "", "verbal": "White has rooks on a1, f2; bishops on c1; kings on d2; pawns on g2, c3, a4, b4, e5; knights on a3; queens on f3. Black has queens on c4; pawns on d5, e6, a7, b7, f7, g7; rooks on a8, f8; knights on b8; kings on g8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3"}
{"pos_id": 122, "position": "", "verbal": "White has rooks on a1, f2; bishops on c1; kings on d2; pawns on g2, c3, a4, b4, e5; knights on a3; queens on f3. Black has queens on h4; pawns on d5, e6, a7, b7, f7, g7; rooks on a8, f8; knights on b8; kings on g8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4"}
{"pos_id": 123, "position": "", "verbal": "White has rooks on a1, f2; bishops on b2; kings on d2; pawns on g2, c3, a4, b4, e5; knights on a3; queens on f3. Black has queens on h4; pawns on d5, e6, a7, b7, f7, g7; rooks on a8, f8; knights on b8; kings on g8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2"}
{"pos_id": 124, "position": "", "verbal": "White has rooks on a1, f2; bishops on b2; kings on d2; pawns on g2, c3, a4, b4, e5; knights on a3; queens on f3. Black has queens on h4; pawns on d5, e6, a7, b7, f7, g7; knights on c6; rooks on a8, f8; kings on g8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6"}
{"pos_id": 125, "position": "", "verbal": "White has rooks on a1, f2; bishops on b2; kings on d2; knights on a3; pawns on c3, g3, a4, b4, e5; queens on f4. Black has pawns on d5, e6, a7, b7, f7, g7; queens on g5; knights on c6; rooks on a8, f8; kings on g8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4"}
{"pos_id": 126, "position": "", "verbal": "White has rooks on a1, f2; bishops on b2; kings on d2; knights on a3; pawns on c3, g3, a4, b4; queens on f4. Black has pawns on d5, e6, a7, b7, f7, g7; queens on e5; knights on c6; rooks on a8, f8; kings on g8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5"}
{"pos_id": 127, "position": "", "verbal": "White has rooks on h1, f2; bishops on b2; kings on d2; knights on a3; pawns on c3, g3, a4, b4; queens on f4. Black has pawns on d5, e6, f6, a7, b7, g7; queens on e5; knights on c6; rooks on a8, f8; kings on g8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6"}
{"pos_id": 128, "position": "", "verbal": "White has rooks on h1, h2; bishops on b2; kings on d2; knights on a3; pawns on c3, g3, a4, b4; queens on f4. Black has pawns on d5, e6, f6, a7, b7, g7; queens on e5; knights on c6; rooks on a8, f8; kings on g8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2"}
{"pos_id": 129, "position": "", "verbal": "White has rooks on h1, h2; bishops on b2; kings on d2; knights on a3; pawns on c3, g3, a4, b4; queens on f4. Black has pawns on d5, e6, f6, a7, b7, g7; queens on e5; knights on c6; kings on f7; rooks on a8, f8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7"}
{"pos_id": 130, "position": "", "verbal": "White has rooks on h1, h2; bishops on b2; kings on d2; pawns on c3, g3, a4, b4; queens on f4; knights on b5. Black has pawns on d5, e6, f6, a7, b7, g7; queens on e5; knights on c6; kings on f7; rooks on d8, f8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8"}
{"pos_id": 131, "position": "", "verbal": "White has rooks on h1, h2; bishops on b2; kings on d2; pawns on c3, g3, a4, b4; knights on d4; queens on f4. Black has pawns on d5, e6, f6, a7, b7, g7; queens on e5; knights on c6; kings on f7; rooks on d8, f8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8 Nd4"}
{"pos_id": 132, "position": "", "verbal": "White has rooks on h1, h2; bishops on b2; kings on d2; pawns on c3, a4, f4, b5; knights on d4. Black has pawns on d5, e6, f6, a7, b7, g7; knights on e7; kings on f7; rooks on d8, f8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8 Nd4 Qxf4+ gxf4 Ne7 b5"}
{"pos_id": 133, "position": "", "verbal": "White has rooks on h1, h2; kings on d2; bishops on a3; pawns on c3, a4, b5; knights on d4. Black has pawns on d5, f5, f6, a7, b7, g7; knights on g6; kings on f7; rooks on d8, e8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8 Nd4 Qxf4+ gxf4 Ne7 b5 Ng6 Ba3 Rfe8 f5 exf5"}
{"pos_id": 134, "position": "", "verbal": "White has rooks on g1, h2; kings on d2; bishops on a3; pawns on c3, a4, b5; knights on d6. Black has pawns on d5, f6, a7, b7, g7; rooks on e5, d8; kings on e6; knights on g6. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8 Nd4 Qxf4+ gxf4 Ne7 b5 Ng6 Ba3 Rfe8 f5 exf5 Nxf5 Re5 Nd6+ Ke6 Rg1"}
{"pos_id": 135, "position": "", "verbal": "White has rooks on g1, h2; kings on d2; bishops on a3; pawns on c3, a4, b5; knights on b7. Black has knights on f4; pawns on d5, f6, a7, g7; rooks on e5, d8; kings on e6. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8 Nd4 Qxf4+ gxf4 Ne7 b5 Ng6 Ba3 Rfe8 f5 exf5 Nxf5 Re5 Nd6+ Ke6 Rg1 Nf4 Nxb7"}
{"pos_id": 136, "position": "", "verbal": "White has kings on d2; rooks on h2, e7; bishops on a3; pawns on a4, d4, b5; knights on d6. Black has knights on f4; rooks on d5, c8; kings on f5; pawns on f6, a7. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8 Nd4 Qxf4+ gxf4 Ne7 b5 Ng6 Ba3 Rfe8 f5 exf5 Nxf5 Re5 Nd6+ Ke6 Rg1 Nf4 Nxb7 Rc8 Rxg7 d4 cxd4 Rd5 Re7+ Kf5 Nd6+"}
{"pos_id": 137, "position": "", "verbal": "White has kings on d2; rooks on h2, e7; bishops on a3; pawns on a4, d4, b5; knights on d6. Black has knights on f4; kings on g4; rooks on d5, c8; pawns on f6, a7. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8 Nd4 Qxf4+ gxf4 Ne7 b5 Ng6 Ba3 Rfe8 f5 exf5 Nxf5 Re5 Nd6+ Ke6 Rg1 Nf4 Nxb7 Rc8 Rxg7 d4 cxd4 Rd5 Re7+ Kf5 Nd6+ Kg4"}
{"pos_id": 138, "position": "", "verbal": "White has kings on d2; rooks on h2, g7; bishops on a3; pawns on a4, d4, b5; knights on c8. Black has kings on f3; knights on f4; rooks on d5; pawns on f6, a7. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8 Nd4 Qxf4+ gxf4 Ne7 b5 Ng6 Ba3 Rfe8 f5 exf5 Nxf5 Re5 Nd6+ Ke6 Rg1 Nf4 Nxb7 Rc8 Rxg7 d4 cxd4 Rd5 Re7+ Kf5 Nd6+ Kg4 Rg7+ Kf3 Nxc8"}
{"pos_id": 139, "position": "", "verbal": "White has bishops on b2; rooks on h2, g7; kings on b3; pawns on b5. Black has kings on f3; knights on f4; pawns on f6, a7; rooks on c8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8 Nd4 Qxf4+ gxf4 Ne7 b5 Ng6 Ba3 Rfe8 f5 exf5 Nxf5 Re5 Nd6+ Ke6 Rg1 Nf4 Nxb7 Rc8 Rxg7 d4 cxd4 Rd5 Re7+ Kf5 Nd6+ Kg4 Rg7+ Kf3 Nxc8 Rxd4+ Kc2 Rxa4 Bb2 Rc4+ Kb3 Rxc8"}
{"pos_id": 140, "position": "", "verbal": "White has rooks on h2, g7; kings on b3; pawns on b5; bishops on f6. Black has kings on f3; knights on f4; pawns on a7; rooks on c8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8 Nd4 Qxf4+ gxf4 Ne7 b5 Ng6 Ba3 Rfe8 f5 exf5 Nxf5 Re5 Nd6+ Ke6 Rg1 Nf4 Nxb7 Rc8 Rxg7 d4 cxd4 Rd5 Re7+ Kf5 Nd6+ Kg4 Rg7+ Kf3 Nxc8 Rxd4+ Kc2 Rxa4 Bb2 Rc4+ Kb3 Rxc8 Bxf6"}
{"pos_id": 141, "position": "", "verbal": "White has rooks on h2, g7; kings on b3; pawns on b5; bishops on f6. Black has kings on f3; knights on d5; pawns on a7; rooks on c8. false.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8 Nd4 Qxf4+ gxf4 Ne7 b5 Ng6 Ba3 Rfe8 f5 exf5 Nxf5 Re5 Nd6+ Ke6 Rg1 Nf4 Nxb7 Rc8 Rxg7 d4 cxd4 Rd5 Re7+ Kf5 Nd6+ Kg4 Rg7+ Kf3 Nxc8 Rxd4+ Kc2 Rxa4 Bb2 Rc4+ Kb3 Rxc8 Bxf6 Nd5"}
{"pos_id": 142, "position": "", "verbal": "White has bishops on b2; kings on b3; rooks on h4, f7; pawns on b5. Black has kings on e4; knights on f4; pawns on a7; rooks on c8. true.", "move_history_copy": "e4 c5 c3 e6 d4 d5 e5 Qb6 Nf3 Bd7 Bd3 Bb5 dxc5 Bxc5 b4 Bxf2+ Ke2 Bxd3+ Qxd3 Nh6 Rf1 Ng4 h3 h5 hxg4 hxg4 Rxf2 gxf3+ Qxf3 Qb5+ Kd2 O-O a4 Qc4 Na3 Qh4 Bb2 Nc6 g3 Qg5+ Qf4 Qxe5 Rh1 f6 Rfh2 Kf7 Nb5 Rad8 Nd4 Qxf4+ gxf4 Ne7 b5 Ng6 Ba3 Rfe8 f5 exf5 Nxf5 Re5 Nd6+ Ke6 Rg1 Nf4 Nxb7 Rc8 Rxg7 d4 cxd4 Rd5 Re7+ Kf5 Nd6+ Kg4 Rg7+ Kf3 Nxc8 Rxd4+ Kc2 Rxa4 Bb2 Rc4+ Kb3 Rxc8 Bxf6 Nd5 Rf7 Ke4 Bb2 Nf4 Rh4"}
{"pos_id": 145, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, e4. Black has pawns on d4, a7, b7, d7, e7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 c5 d4 cxd4"}
{"pos_id": 146, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, e4; queens on d4. Black has pawns on a7, b7, d7, e7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 c5 d4 cxd4 Qxd4"}
{"pos_id": 147, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, e4; queens on d4. Black has knights on c6, g8; pawns on a7, b7, d7, e7, f7, g7, h7; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 c5 d4 cxd4 Qxd4 Nc6"}
{"pos_id": 148, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, e4; queens on e3. Black has knights on c6, g8; pawns on a7, b7, d7, e7, f7, g7, h7; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 c5 d4 cxd4 Qxd4 Nc6 Qe3"}
{"pos_id": 149, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, e4; queens on e3. Black has knights on c6, g8; pawns on g6, a7, b7, d7, e7, f7, h7; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 c5 d4 cxd4 Qxd4 Nc6 Qe3 g6"}
{"pos_id": 150, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, e4; queens on e3. Black has knights on c6, g8; pawns on g6, a7, b7, d7, e7, f7, h7; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 c5 d4 cxd4 Qxd4 Nc6 Qe3 g6 Nc3"}
{"pos_id": 151, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, e4; queens on e3. Black has knights on c6, g8; pawns on g6, a7, b7, d7, e7, f7, h7; bishops on g7, c8; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "e4 c5 d4 cxd4 Qxd4 Nc6 Qe3 g6 Nc3 Bg7"}
{"pos_id": 152, "position": "", "verbal": "White has rooks on a1, h1; kings on e1; bishops on f1, d2; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, e4; queens on e3. Black has knights on c6, g8; pawns on g6, a7, b7, d7, e7, f7, h7; bishops on g7, c8; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "e4 c5 d4 cxd4 Qxd4 Nc6 Qe3 g6 Nc3 Bg7 Bd2"}
{"pos_id": 153, "position": "", "verbal": "White has kings on c1; rooks on d1, h1; bishops on f1, d2; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, e4; queens on e3. Black has knights on c6, f6; pawns on g6, a7, b7, d7, e7, f7, h7; bishops on g7, c8; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "e4 c5 d4 cxd4 Qxd4 Nc6 Qe3 g6 Nc3 Bg7 Bd2 Nf6 O-O-O"}
{"pos_id": 154, "position": "", "verbal": "White has kings on c1; rooks on d1, h1; bishops on f1, d2; knights on g1; pawns on a2, b2, c2, f2, g2, h4; queens on g3. Black has knights on c6; pawns on g6, a7, b7, e7, f7, h7; bishops on h6, c8; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "e4 c5 d4 cxd4 Qxd4 Nc6 Qe3 g6 Nc3 Bg7 Bd2 Nf6 O-O-O O-O h4 d5 exd5 Nxd5 Qg3 Nxc3 Bxc3 Bh6+ Bd2"}
{"pos_id": 155, "position": "", "verbal": "White has kings on c1; rooks on d1, h1; bishops on f1, d2; knights on g1; pawns on a2, b2, c2, f2, g2, h4; queens on g3. Black has knights on b4; pawns on g6, a7, b7, e7, f7, h7; bishops on h6, c8; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "e4 c5 d4 cxd4 Qxd4 Nc6 Qe3 g6 Nc3 Bg7 Bd2 Nf6 O-O-O O-O h4 d5 exd5 Nxd5 Qg3 Nxc3 Bxc3 Bh6+ Bd2 Nb4"}
{"pos_id": 159, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c4, d5. Black has pawns on d4, a7, b7, e7, f7, g7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 c5 d4 cxd4 c3 d5 exd5 Nf6 c4"}
{"pos_id": 160, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c4, d5. Black has pawns on d4, e6, a7, b7, f7, g7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 c5 d4 cxd4 c3 d5 exd5 Nf6 c4 e6"}
{"pos_id": 161, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c4, d5. Black has pawns on d4, e6, a7, b7, f7, g7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 c5 d4 cxd4 c3 d5 exd5 Nf6 c4 e6 Nf3"}
{"pos_id": 162, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c4. Black has pawns on d4, d5, a7, b7, f7, g7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 c5 d4 cxd4 c3 d5 exd5 Nf6 c4 e6 Nf3 exd5"}
{"pos_id": 164, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, d2, f2, g2, h2, e4. Black has pawns on e6, a7, b7, c7, d7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 e6"}
{"pos_id": 165, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, d4, e4. Black has pawns on c5, e6, a7, b7, d7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 e6 d4 c5"}
{"pos_id": 166, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, d5. Black has pawns on c5, d6, a7, b7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6"}
{"pos_id": 167, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, d5. Black has pawns on c5, d6, a7, b7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3"}
{"pos_id": 168, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, d5. Black has pawns on c5, d6, a7, b7, f7, g7, h7; bishops on e7, c8; rooks on a8, h8; knights on b8, g8; queens on d8; kings on e8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7"}
{"pos_id": 169, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, d5; knights on c3, f3. Black has pawns on c5, d6, a7, b7, f7, g7, h7; bishops on e7, c8; rooks on a8, h8; knights on b8, g8; queens on d8; kings on e8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3"}
{"pos_id": 170, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, d5; knights on c3, f3. Black has pawns on c5, d6, a7, b7, f7, g7, h7; knights on f6, b8; bishops on e7, c8; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6"}
{"pos_id": 171, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; pawns on b2, c2, f2, g2, h2, a4, d5; knights on c3, f3. Black has pawns on c5, d6, a7, b7, f7, g7, h7; knights on f6, b8; bishops on e7, c8; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4"}
{"pos_id": 172, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; pawns on b2, c2, f2, g2, h2, a4, d5; knights on c3, f3. Black has pawns on c5, d6, a7, b7, f7, g7, h7; knights on f6, b8; bishops on e7, c8; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O"}
{"pos_id": 173, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, d3; queens on d1; kings on e1; pawns on b2, c2, f2, g2, h2, a4, d5; knights on c3, f3. Black has pawns on c5, d6, a7, b7, f7, g7, h7; knights on f6, b8; bishops on e7, c8; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3"}
{"pos_id": 174, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, d3; queens on d1; kings on e1; pawns on b2, c2, f2, g2, h2, a4, d5; knights on c3, f3. Black has bishops on g4, e7; pawns on c5, d6, a7, b7, f7, g7, h7; knights on f6, b8; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4"}
{"pos_id": 175, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, d3; queens on d1; kings on e1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3, f3. Black has bishops on g4, e7; pawns on c5, d6, a7, b7, f7, g7, h7; knights on f6, b8; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3"}
{"pos_id": 176, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, d3; kings on e1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; queens on f3. Black has pawns on c5, d6, a7, b7, f7, g7, h7; knights on f6, b8; bishops on e7; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3"}
{"pos_id": 177, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, d3; kings on e1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; queens on f3. Black has pawns on c5, d6, a7, b7, f7, g7, h7; knights on f6, b8; bishops on e7; rooks on a8, e8; queens on d8; kings on g8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8"}
{"pos_id": 178, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1, d3; kings on g1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; queens on f3. Black has pawns on c5, d6, a7, b7, f7, g7, h7; knights on f6, d7; bishops on e7; rooks on a8, e8; queens on d8; kings on g8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7"}
{"pos_id": 179, "position": "", "verbal": "White has rooks on a1, f1; kings on g1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; bishops on d3, f4; queens on f3. Black has pawns on c5, d6, a7, b7, f7, g7, h7; knights on f6, d7; bishops on e7; rooks on a8, e8; queens on d8; kings on g8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4"}
{"pos_id": 180, "position": "", "verbal": "White has rooks on a1, f1; kings on g1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; bishops on d3, f4; queens on f3. Black has pawns on c5, d6, a7, b7, f7, g7, h7; knights on e5, f6; bishops on e7; rooks on a8, e8; queens on d8; kings on g8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5"}
{"pos_id": 181, "position": "", "verbal": "White has rooks on a1, f1; kings on g1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; bishops on d3; queens on f3. Black has pawns on c5, e5, a7, b7, f7, g7, h7; knights on f6; bishops on e7; rooks on a8, e8; queens on d8; kings on g8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5"}
{"pos_id": 182, "position": "", "verbal": "White has rooks on a1, f1; kings on g1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; queens on f3; bishops on b5. Black has pawns on c5, e5, a7, b7, f7, g7, h7; knights on f6; bishops on e7; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8"}
{"pos_id": 183, "position": "", "verbal": "White has rooks on a1, e1; kings on g1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; queens on f3; bishops on b5. Black has pawns on c5, e5, a7, b7, f7, g7, h7; knights on f6; bishops on e7; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1"}
{"pos_id": 184, "position": "", "verbal": "White has rooks on a1, e1; kings on g1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; queens on f3; bishops on b5. Black has pawns on c5, e5, a7, b7, f7, g7, h7; bishops on d6; knights on f6; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6"}
{"pos_id": 185, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; queens on f3; bishops on b5. Black has pawns on c5, e5, a7, b7, f7, g7, h7; bishops on d6; knights on f6; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1"}
{"pos_id": 186, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; queens on f3; bishops on b5. Black has pawns on c5, e5, a6, b7, f7, g7, h7; bishops on d6; knights on f6; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6"}
{"pos_id": 187, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; bishops on d3; queens on f3. Black has pawns on c5, e5, a6, b7, f7, g7, h7; bishops on d6; knights on f6; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3"}
{"pos_id": 188, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on b2, c2, f2, g2, h3, a4, d5; knights on c3; bishops on d3; queens on f3. Black has pawns on c5, e5, a6, g6, b7, f7, h7; bishops on d6; knights on f6; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6"}
{"pos_id": 189, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on b2, c2, f2, g2, h3, a5, d5; knights on c3; bishops on d3; queens on f3. Black has pawns on c5, e5, a6, g6, b7, f7, h7; bishops on d6; knights on f6; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5"}
{"pos_id": 190, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on b2, c2, f2, g2, h3, a5, d5; knights on c3; bishops on d3; queens on f3. Black has pawns on c5, e5, a6, g6, b7, f7, h7; bishops on d6; knights on f6; kings on g7; rooks on a8, f8; queens on d8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7"}
{"pos_id": 191, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on b2, c2, f2, g2, h3, d5; knights on c3; bishops on d3; queens on f3. Black has queens on a5; pawns on c5, e5, a6, g6, b7, f7, h7; bishops on d6; knights on f6; kings on g7; rooks on a8, f8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3"}
{"pos_id": 192, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on b2, c2, f2, h3, g4, d5; knights on c3; bishops on d3; queens on f3. Black has queens on a5; pawns on c5, e5, a6, g6, b7, f7, h7; bishops on d6; knights on f6; kings on g7; rooks on a8, e8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4"}
{"pos_id": 193, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on b2, c2, f2, h3, g4, d5; knights on c3; queens on f3; bishops on c4. Black has queens on a5; pawns on e5, a6, g6, b7, f7, h7; bishops on d6; knights on f6; kings on g7; rooks on a8, e8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4"}
{"pos_id": 194, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on b2, c2, f2, h3, g4, d5; bishops on b3; knights on c3; queens on f3. Black has queens on b4; pawns on e4, a6, g6, b7, f7, h7; bishops on d6; knights on f6; kings on g7; rooks on a8, e8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4"}
{"pos_id": 195, "position": "", "verbal": "White has rooks on d1; kings on g1; pawns on b2, c2, f2, h3, d5, g5; bishops on b3; knights on c3; queens on e4. Black has queens on b4; bishops on c5; knights on h5; pawns on a6, g6, b7, f7, h7; kings on g7; rooks on a8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4"}
{"pos_id": 196, "position": "", "verbal": "White has rooks on d1; kings on g1; pawns on b2, c2, f2, h3, d5, g5; bishops on b3; knights on c3; queens on e4. Black has bishops on c5; knights on h5; pawns on a6, g6, b7, f7, h7; queens on b6; kings on g7; rooks on a8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6"}
{"pos_id": 197, "position": "", "verbal": "White has rooks on d1; kings on g1; pawns on b2, c2, f2, h3, g5, d6; bishops on b3; knights on c3; queens on f3. Black has bishops on c5; pawns on f5, a6, g6, b7, h7; knights on h5; queens on b6; kings on g7; rooks on e8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5"}
{"pos_id": 198, "position": "", "verbal": "White has rooks on d1; pawns on b2, c2, f2, h3, d6; kings on g2; bishops on b3. Black has rooks on e2; kings on f5; pawns on a6, g6, b7, h7; bishops on b6. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2"}
{"pos_id": 199, "position": "", "verbal": "White has rooks on d1; pawns on b2, c2, f2, h3, d7; kings on g2; bishops on b3. Black has rooks on e2; kings on f5; pawns on a6, g6, b7, h7; bishops on d8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8"}
{"pos_id": 200, "position": "", "verbal": "White has pawns on b2, c2, f2, h3, d7; kings on g2; bishops on b3; rooks on d3. Black has rooks on e2; kings on f5; pawns on a6, g6, b7, h7; bishops on d8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3"}
{"pos_id": 201, "position": "", "verbal": "White has pawns on b2, c2, f2, h3, d7; kings on g2; bishops on b3; rooks on h6. Black has pawns on a6, g6, b7; kings on d6; rooks on g7; bishops on d8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7"}
{"pos_id": 202, "position": "", "verbal": "White has pawns on b2, c2, f2, h4; kings on g2; bishops on b3; rooks on h6. Black has pawns on a6, g6, b7; kings on d7; rooks on g7; bishops on d8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7"}
{"pos_id": 203, "position": "", "verbal": "White has pawns on b2, f2, c3, h4; kings on g2; bishops on b3; rooks on h6. Black has pawns on a6, g6, b7; kings on d7; rooks on g7; bishops on d8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3"}
{"pos_id": 204, "position": "", "verbal": "White has pawns on b2, f2, c3, h4; kings on g2; bishops on b3; rooks on h6. Black has pawns on b5, a6, g6; kings on d7; rooks on g7; bishops on d8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5"}
{"pos_id": 205, "position": "", "verbal": "White has pawns on b2, f2, c3, h4; bishops on c2; kings on g2; rooks on h6. Black has pawns on b5, a6, g6; kings on d7; rooks on g7; bishops on d8. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2"}
{"pos_id": 206, "position": "", "verbal": "White has pawns on b2, f2, c3, h4; bishops on c2; kings on g2; rooks on h6. Black has pawns on a5, b5, g6; kings on d7; rooks on g7; bishops on d8. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5"}
{"pos_id": 207, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on g2; bishops on g6; rooks on h6. Black has bishops on h4; pawns on a5, b5; kings on d7; rooks on g7. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4"}
{"pos_id": 208, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on f3; rooks on h4. Black has pawns on a5, b5; rooks on g6; kings on d7. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3"}
{"pos_id": 209, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on f3; rooks on h4. Black has pawns on a4, b5; rooks on g6; kings on d7. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4"}
{"pos_id": 210, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on f3; rooks on h5. Black has pawns on a4, b5; rooks on g6; kings on d7. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5"}
{"pos_id": 211, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on f3; rooks on h5. Black has pawns on a4, b5; kings on c6; rooks on g6. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6"}
{"pos_id": 212, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on e3; rooks on h5. Black has pawns on a4, b5; kings on c6; rooks on g6. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3"}
{"pos_id": 213, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on e3; rooks on h5. Black has pawns on a4, b5; kings on c6; rooks on e6. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+"}
{"pos_id": 214, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on d2; rooks on h5. Black has pawns on a4, b5; kings on c6; rooks on e6. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2"}
{"pos_id": 215, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on d2; rooks on h5. Black has pawns on a4, b5; kings on c6; rooks on d6. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+"}
{"pos_id": 216, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on c2; rooks on h5. Black has pawns on a4, b5; kings on c6; rooks on d6. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2"}
{"pos_id": 217, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on c2; rooks on h5. Black has pawns on a4, b5; kings on c6; rooks on f6. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6"}
{"pos_id": 218, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on c2; rooks on h2. Black has pawns on a4, b5; kings on c6; rooks on f6. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2"}
{"pos_id": 219, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on c2; rooks on h2. Black has rooks on f3; pawns on a4, b5; kings on c6. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3"}
{"pos_id": 220, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on d2; rooks on h2. Black has rooks on f3; pawns on a4, b5; kings on c6. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2"}
{"pos_id": 221, "position": "", "verbal": "White has pawns on b2, f2, c3; kings on d2; rooks on h2. Black has rooks on f3; pawns on a4, b4; kings on c6. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4"}
{"pos_id": 222, "position": "", "verbal": "White has pawns on b2, f2, b4; kings on d2; rooks on h2. Black has rooks on f3; pawns on a4; kings on c6. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4"}
{"pos_id": 223, "position": "", "verbal": "White has pawns on b2, f2, b4; kings on d2; rooks on h2. Black has rooks on f3; pawns on a4; kings on b5. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5"}
{"pos_id": 224, "position": "", "verbal": "White has pawns on b2, f2, b4; kings on c2; rooks on h2. Black has rooks on f3; pawns on a4; kings on b5. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5 Kc2"}
{"pos_id": 225, "position": "", "verbal": "White has pawns on b2, f2; kings on c2; rooks on h2. Black has rooks on f3; pawns on a4; kings on b4. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5 Kc2 Kxb4"}
{"pos_id": 226, "position": "", "verbal": "White has pawns on b2, f2; kings on c2; rooks on h4. Black has rooks on f3; pawns on a4; kings on b4. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5 Kc2 Kxb4 Rh4+"}
{"pos_id": 227, "position": "", "verbal": "White has pawns on b2, f2; kings on c2; rooks on h4. Black has rooks on f3; pawns on a4; kings on b5. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5 Kc2 Kxb4 Rh4+ Kb5"}
{"pos_id": 228, "position": "", "verbal": "White has pawns on b2, f2; kings on c2; rooks on h5. Black has rooks on f3; pawns on a4; kings on b5. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5 Kc2 Kxb4 Rh4+ Kb5 Rh5+"}
{"pos_id": 229, "position": "", "verbal": "White has pawns on b2, f2; kings on c2; rooks on h5. Black has rooks on f3; pawns on a4; kings on b4. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5 Kc2 Kxb4 Rh4+ Kb5 Rh5+ Kb4"}
{"pos_id": 230, "position": "", "verbal": "White has pawns on b2, f2; kings on c2; rooks on h2. Black has rooks on f3; pawns on a4; kings on b4. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5 Kc2 Kxb4 Rh4+ Kb5 Rh5+ Kb4 Rh2"}
{"pos_id": 231, "position": "", "verbal": "White has pawns on b2, f2; kings on c2; rooks on h2. Black has rooks on f3; pawns on a4; kings on b5. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5 Kc2 Kxb4 Rh4+ Kb5 Rh5+ Kb4 Rh2 Kb5"}
{"pos_id": 232, "position": "", "verbal": "White has pawns on b2, f2; kings on c2; rooks on g2. Black has rooks on f3; pawns on a4; kings on b5. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5 Kc2 Kxb4 Rh4+ Kb5 Rh5+ Kb4 Rh2 Kb5 Rg2"}
{"pos_id": 233, "position": "", "verbal": "White has pawns on b2, f2; kings on c2; rooks on g2. Black has rooks on f3; pawns on a4; kings on b4. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5 Kc2 Kxb4 Rh4+ Kb5 Rh5+ Kb4 Rh2 Kb5 Rg2 Kb4"}
{"pos_id": 234, "position": "", "verbal": "White has kings on b1; pawns on b2, f2; rooks on g2. Black has rooks on f3; pawns on a4; kings on b4. true.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5 Kc2 Kxb4 Rh4+ Kb5 Rh5+ Kb4 Rh2 Kb5 Rg2 Kb4 Kb1"}
{"pos_id": 235, "position": "", "verbal": "White has kings on b1; pawns on g3. Black has kings on a3. false.", "move_history_copy": "e4 e6 d4 c5 d5 exd5 exd5 d6 Nc3 Be7 Nf3 Nf6 a4 O-O Bd3 Bg4 h3 Bxf3 Qxf3 Re8 O-O Nbd7 Bf4 Ne5 Bxe5 dxe5 Bb5 Rf8 Rfe1 Bd6 Rad1 a6 Bd3 g6 a5 Kg7 Na4 Qxa5 Nc3 Rfe8 g4 c4 Bxc4 Qb4 Bb3 e4 Qg2 Bc5 g5 Nh5 Rxe4 Rxe4 Qxe4 Qb6 Qf3 Re8 d6 f5 gxf6+ Nxf6 Qxf6+ Kxf6 Nd5+ Kf5 Nxb6 Bxb6 Kg2 Re2 d7 Bd8 Rd3 Kf6 Rf3+ Ke7 Rf7+ Kd6 Rxh7 Re7 Rh6 Rg7 h4 Kxd7 c3 b5 Bc2 a5 Bxg6 Bxh4 Rxh4 Rxg6+ Kf3 a4 Rh5 Kc6 Ke3 Re6+ Kd2 Rd6+ Kc2 Rf6 Rh2 Rf3 Kd2 b4 cxb4 Kb5 Kc2 Kxb4 Rh4+ Kb5 Rh5+ Kb4 Rh2 Kb5 Rg2 Kb4 Kb1 Kb3 Rg3 Rxg3 fxg3 a3 bxa3 Kxa3"}
{"pos_id": 237, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, d2, f2, g2, h2, e4. Black has pawns on e5, a7, b7, c7, d7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 e5"}
{"pos_id": 238, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, d2, f2, g2, h2, e4. Black has pawns on e5, a7, b7, c7, d7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 e5 Nf3"}
{"pos_id": 239, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, d2, f2, g2, h2, e4. Black has pawns on e5, a7, b7, c7, d7, f7, g7, h7; knights on c6, g8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 e5 Nf3 Nc6"}
{"pos_id": 240, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, d2, f2, g2, h2, c3, e4. Black has pawns on e5, a7, b7, c7, d7, f7, g7, h7; knights on c6, g8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3"}
{"pos_id": 241, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, d2, f2, g2, h2, c3, e4. Black has pawns on e5, d6, a7, b7, c7, f7, g7, h7; knights on c6, g8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6"}
{"pos_id": 242, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c3, d4, e4. Black has pawns on e5, d6, a7, b7, c7, f7, g7, h7; knights on c6, g8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4"}
{"pos_id": 243, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c3, d4, e4. Black has pawns on e5, d6, a7, b7, c7, f7, g7, h7; knights on c6, f6; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6"}
{"pos_id": 244, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, d3; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c3, d4, e4. Black has pawns on e5, d6, a7, b7, c7, f7, g7, h7; knights on c6, f6; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3"}
{"pos_id": 245, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, d3; queens on d1; kings on e1; pawns on a2, b2, f2, g2, h2, c3, d4, e4. Black has pawns on d5, e5, a7, b7, c7, f7, g7, h7; knights on c6, f6; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5"}
{"pos_id": 246, "position": "", "verbal": "White has rooks on a1, f1; knights on b1, f3; bishops on c1, d3; queens on d1; kings on g1; pawns on a2, b2, f2, g2, h2, c3, d4. Black has queens on d5; pawns on e5, a7, b7, c7, f7, g7, h7; knights on c6, f6; rooks on a8, h8; bishops on c8, f8; kings on e8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O"}
{"pos_id": 247, "position": "", "verbal": "White has rooks on a1, e1; knights on b1, f3; bishops on c1, d3; queens on d1; kings on g1; pawns on a2, b2, f2, g2, h2, c4, d4. Black has pawns on e4, a7, b7, c7, f7, g7, h7; queens on f5; knights on c6, f6; bishops on e7, c8; rooks on a8, h8; kings on e8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5"}
{"pos_id": 248, "position": "", "verbal": "White has rooks on a1, e1; knights on b1, f3; bishops on c1, c2; queens on d1; kings on g1; pawns on a2, b2, f2, g2, h2, c4, d4. Black has knights on b4, f6; pawns on e4, a7, b7, c7, f7, g7, h7; queens on f5; bishops on e7, c8; rooks on a8, h8; kings on e8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4"}
{"pos_id": 249, "position": "", "verbal": "White has rooks on a1, e1; knights on b1, e5; bishops on c1, c2; queens on d1; kings on g1; pawns on a2, b2, f2, g2, h2, c4, d4. Black has knights on b4, f6; pawns on e4, a7, b7, c7, f7, g7, h7; queens on f5; bishops on e7, c8; rooks on a8, h8; kings on e8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5"}
{"pos_id": 250, "position": "", "verbal": "White has rooks on a1, e1; knights on b1, e5; kings on g1; pawns on a2, b2, f2, g2, h2, c4, d4; bishops on e3. Black has bishops on f5, e7; knights on f6; pawns on a7, b7, c7, f7, g7, h7; rooks on a8, h8; kings on e8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3"}
{"pos_id": 251, "position": "", "verbal": "White has rooks on a1, e1; knights on b1, e5; kings on g1; pawns on a2, b2, f2, g2, h2, c4, d4; bishops on e3. Black has bishops on f5, e7; knights on f6; pawns on a7, b7, c7, f7, g7, h7; rooks on a8, f8; kings on g8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O"}
{"pos_id": 252, "position": "", "verbal": "White has rooks on a1, e1; kings on g1; pawns on a2, b2, f2, g2, h2, c4, d4; knights on c3, e5; bishops on e3. Black has bishops on f5, e7; knights on f6; pawns on a7, b7, c7, f7, g7, h7; rooks on a8, f8; kings on g8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3"}
{"pos_id": 253, "position": "", "verbal": "White has rooks on a1, e1; kings on g1; pawns on a2, b2, f2, g2, h2, c4, d4; knights on c3, e5; bishops on e3. Black has bishops on f5, e7; knights on f6; pawns on a7, b7, c7, f7, g7, h7; rooks on a8, e8; kings on g8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8"}
{"pos_id": 254, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on a2, b2, f2, g2, h3, c4, d4; knights on c3, e5; bishops on e3. Black has bishops on f5, e7; pawns on h5, c6, a7, b7, f7, g7; knights on f6; rooks on a8, e8; kings on g8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5"}
{"pos_id": 255, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on a2, b2, f2, g2, h3, c4, d4; knights on c3, e5; bishops on g5. Black has bishops on f5, e7; pawns on h5, c6, a7, b7, f7, g7; knights on f6; rooks on c8, e8; kings on g8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8"}
{"pos_id": 256, "position": "", "verbal": "White has rooks on d1, e1; kings on g1; pawns on a2, b2, f2, g2, h3, c4, d4; knights on c3, f3; bishops on g5. Black has bishops on f5, e7; pawns on h5, c6, a7, b7, f7, g7; knights on f6; rooks on c8, e8; kings on g8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3"}
{"pos_id": 257, "position": "", "verbal": "White has rooks on d1, e5; kings on g1; pawns on a2, b2, f2, g2, h3, c4, d4; knights on c3, f3; bishops on g5. Black has bishops on f5, f8; pawns on h5, c6, a7, b7, f7, g7; knights on f6; rooks on c8, e8; kings on g8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5"}
{"pos_id": 258, "position": "", "verbal": "White has rooks on d1; kings on g1; pawns on a2, b2, f2, g2, h3, c4, e5; knights on c3, f3; bishops on g5. Black has bishops on f5, f8; pawns on h5, c6, a7, b7, f7, g7; knights on f6; rooks on c8; kings on g8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5"}
{"pos_id": 259, "position": "", "verbal": "White has rooks on d1; kings on g1; pawns on a2, f2, g2, b3, h3, c4; knights on c3; bishops on g5. Black has knights on e5; pawns on h5, c6, a7, b7, g7; bishops on g6; rooks on f8; kings on g8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3"}
{"pos_id": 260, "position": "", "verbal": "White has rooks on d1; kings on g1; pawns on a2, f2, g2, b3, h3, c4; knights on c3; bishops on e3. Black has knights on d3; pawns on h5, c6, a7, b7, g7; bishops on g6; rooks on f8; kings on g8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3"}
{"pos_id": 261, "position": "", "verbal": "White has rooks on d1; kings on g1; pawns on a2, f2, g2, b3, h3, c4; knights on c3; bishops on e3. Black has knights on d3; pawns on h5, a6, c6, b7, g7; bishops on g6; rooks on f8; kings on g8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6"}
{"pos_id": 262, "position": "", "verbal": "White has rooks on d1; kings on g1; pawns on a2, f2, g2, b3, h3, c4; knights on e2; bishops on e3. Black has knights on d3; pawns on b5, h5, a6, c6, g7; bishops on g6; rooks on f8; kings on g8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5"}
{"pos_id": 263, "position": "", "verbal": "White has kings on g1; pawns on a2, f2, g2, h3, c4; rooks on d2; knights on e2; bishops on e3. Black has knights on d3; pawns on h5, a6, c6, g7; bishops on g6; rooks on f8; kings on g8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4"}
{"pos_id": 264, "position": "", "verbal": "White has kings on g1; pawns on a2, f2, g2, h3, c4; rooks on d2; knights on e2; bishops on e3. Black has knights on d3; pawns on h5, a6, c6, g7; bishops on g6; rooks on b8; kings on g8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8"}
{"pos_id": 265, "position": "", "verbal": "White has kings on g1; pawns on a2, f2, g2, h3, c4; rooks on d2; knights on b3; bishops on e3. Black has knights on d3; pawns on c5, h5, a6, g7; bishops on g6; rooks on b8; kings on g8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3"}
{"pos_id": 266, "position": "", "verbal": "White has kings on g1; pawns on a2, f2, g2, h3, c4; rooks on d2; knights on b3; bishops on e3. Black has knights on d3; rooks on b4; pawns on c5, h5, a6, g7; bishops on g6; kings on g8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4"}
{"pos_id": 267, "position": "", "verbal": "White has kings on g1; pawns on a2, f2, g2, h3; rooks on d2; bishops on d4. Black has rooks on c4; pawns on h5, a6, g7; bishops on g6; kings on g8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4"}
{"pos_id": 268, "position": "", "verbal": "White has pawns on a2, f2, g2, h3; rooks on d2; kings on h2; bishops on d4. Black has rooks on c1; pawns on h5, a6, g7; bishops on g6; kings on g8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2"}
{"pos_id": 269, "position": "", "verbal": "White has pawns on a2, f2, g2, h3; rooks on d2; kings on h2; bishops on d4. Black has rooks on c2; pawns on h5, a6, g7; bishops on g6; kings on g8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2"}
{"pos_id": 270, "position": "", "verbal": "White has pawns on a2, f2, g2, h3; kings on h2; bishops on d4. Black has bishops on c2; pawns on h5, a6, g7; kings on g8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2"}
{"pos_id": 271, "position": "", "verbal": "White has pawns on a2, f2, g2, h3; kings on g3; bishops on d4. Black has bishops on c2; pawns on h5, a6, g7; kings on g8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3"}
{"pos_id": 272, "position": "", "verbal": "White has pawns on a2, f2, g2, h3; kings on g3; bishops on d4. Black has bishops on c2; pawns on h5, a6, g6; kings on g8. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6"}
{"pos_id": 273, "position": "", "verbal": "White has pawns on a2, f2, g2, h3; bishops on d4; kings on f4. Black has bishops on c2; pawns on h5, a6, g6; kings on g8. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4"}
{"pos_id": 274, "position": "", "verbal": "White has pawns on a2, f2, g2, h3; bishops on d4; kings on f4. Black has bishops on c2; pawns on h5, a6, g6; kings on f7. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7"}
{"pos_id": 275, "position": "", "verbal": "White has pawns on a2, f2, g2, h3; bishops on d4; kings on e5. Black has bishops on c2; pawns on h5, a6, g6; kings on f7. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5"}
{"pos_id": 276, "position": "", "verbal": "White has pawns on a2, f2, g2, h3; bishops on d4; kings on e5. Black has bishops on b1; pawns on h5, a6, g6; kings on f7. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1"}
{"pos_id": 277, "position": "", "verbal": "White has pawns on f2, g2, a3, h3; bishops on d4; kings on e5. Black has bishops on b1; pawns on h5, a6, g6; kings on f7. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3"}
{"pos_id": 278, "position": "", "verbal": "White has pawns on f2, g2, a3, h3; bishops on d4; kings on e5. Black has bishops on a2; pawns on h5, a6, g6; kings on f7. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2"}
{"pos_id": 279, "position": "", "verbal": "White has pawns on f2, g2, a3, h3; bishops on d4; kings on d6. Black has bishops on a2; pawns on h5, a6, g6; kings on f7. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6"}
{"pos_id": 280, "position": "", "verbal": "White has pawns on f2, g2, a3, h3; bishops on d4; kings on d6. Black has bishops on c4; pawns on h5, a6, g6; kings on f7. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4"}
{"pos_id": 281, "position": "", "verbal": "White has pawns on f2, a3, g3, h3; bishops on d4; kings on d6. Black has bishops on c4; pawns on h5, a6, g6; kings on f7. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3"}
{"pos_id": 282, "position": "", "verbal": "White has pawns on f2, a3, g3, h3; bishops on d4; kings on d6. Black has bishops on f1; pawns on h5, a6, g6; kings on f7. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1"}
{"pos_id": 283, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on d4; kings on d6. Black has bishops on f1; pawns on h5, a6, g6; kings on f7. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4"}
{"pos_id": 284, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on d4; kings on d6. Black has bishops on g2; pawns on h5, a6, g6; kings on f7. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2"}
{"pos_id": 285, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on d4; kings on c5. Black has bishops on g2; pawns on h5, a6, g6; kings on f7. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2 Kc5"}
{"pos_id": 286, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on d4; kings on c5. Black has bishops on f1; pawns on h5, a6, g6; kings on f7. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2 Kc5 Bf1"}
{"pos_id": 287, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on d4; kings on b6. Black has bishops on f1; pawns on h5, a6, g6; kings on f7. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2 Kc5 Bf1 Kb6"}
{"pos_id": 288, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on d4; kings on b6. Black has bishops on d3; pawns on h5, a6, g6; kings on f7. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2 Kc5 Bf1 Kb6 Bd3"}
{"pos_id": 289, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on d4; kings on c5. Black has bishops on d3; pawns on h5, a6, g6; kings on f7. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2 Kc5 Bf1 Kb6 Bd3 Kc5"}
{"pos_id": 290, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on d4; kings on c5. Black has bishops on f1; pawns on h5, a6, g6; kings on f7. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2 Kc5 Bf1 Kb6 Bd3 Kc5 Bf1"}
{"pos_id": 291, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on d4; kings on d5. Black has bishops on f1; pawns on h5, a6, g6; kings on f7. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2 Kc5 Bf1 Kb6 Bd3 Kc5 Bf1 Kd5"}
{"pos_id": 292, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on d4; kings on d5. Black has bishops on d3; pawns on h5, a6, g6; kings on f7. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2 Kc5 Bf1 Kb6 Bd3 Kc5 Bf1 Kd5 Bd3"}
{"pos_id": 293, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on e3; kings on d5. Black has bishops on d3; pawns on h5, a6, g6; kings on f7. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2 Kc5 Bf1 Kb6 Bd3 Kc5 Bf1 Kd5 Bd3 Be3"}
{"pos_id": 294, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on e3; kings on d5. Black has bishops on f1; pawns on h5, a6, g6; kings on f7. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2 Kc5 Bf1 Kb6 Bd3 Kc5 Bf1 Kd5 Bd3 Be3 Bf1"}
{"pos_id": 295, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on e3; kings on d4. Black has bishops on f1; pawns on h5, a6, g6; kings on f7. true.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2 Kc5 Bf1 Kb6 Bd3 Kc5 Bf1 Kd5 Bd3 Be3 Bf1 Kd4"}
{"pos_id": 296, "position": "", "verbal": "White has pawns on f2, a3, g3, h4; bishops on e3; kings on d4. Black has bishops on f1; pawns on h5, a6, g6; kings on e6. false.", "move_history_copy": "e4 e5 Nf3 Nc6 c3 d6 d4 Nf6 Bd3 d5 exd5 Qxd5 O-O e4 Re1 Be7 c4 Qf5 Bc2 Nb4 Ne5 Nxc2 Qxc2 e3 Qxf5 Bxf5 Bxe3 O-O Nc3 Rfe8 h3 c6 Rad1 h5 Bg5 Rac8 Nf3 Bf8 Re5 Rxe5 dxe5 Nd7 Nd4 Bg6 e6 fxe6 Nxe6 Ne5 Nxf8 Rxf8 b3 Nd3 Be3 a6 Ne2 b5 Rd2 bxc4 bxc4 Rb8 Nd4 c5 Nb3 Rb4 Nxc5 Nxc5 Bxc5 Rxc4 Bd4 Rc1+ Kh2 Rc2 Rxc2 Bxc2 Kg3 g6 Kf4 Kf7 Ke5 Bb1 a3 Ba2 Kd6 Bc4 g3 Bf1 h4 Bg2 Kc5 Bf1 Kb6 Bd3 Kc5 Bf1 Kd5 Bd3 Be3 Bf1 Kd4 Ke6"}
{"pos_id": 298, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, d2, f2, g2, h2, e4. Black has pawns on g6, a7, b7, c7, d7, e7, f7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "e4 g6"}
{"pos_id": 299, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, d4, e4. Black has pawns on g6, a7, b7, c7, d7, e7, f7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4"}
{"pos_id": 300, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, g1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, d4, e4. Black has pawns on g6, a7, b7, c7, d7, e7, f7, h7; bishops on g7, c8; rooks on a8, h8; knights on b8, g8; queens on d8; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7"}
{"pos_id": 301, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, d4, e4. Black has pawns on g6, a7, b7, c7, d7, e7, f7, h7; bishops on g7, c8; rooks on a8, h8; knights on b8, g8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3"}
{"pos_id": 302, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, d4, e4. Black has pawns on d6, g6, a7, b7, c7, e7, f7, h7; bishops on g7, c8; rooks on a8, h8; knights on b8, g8; queens on d8; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6"}
{"pos_id": 303, "position": "", "verbal": "White has rooks on a1, h1; queens on d1; kings on e1; bishops on f1, e3; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, d4, e4. Black has pawns on d6, g6, a7, b7, c7, e7, f7, h7; bishops on g7, c8; rooks on a8, h8; knights on b8, g8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3"}
{"pos_id": 304, "position": "", "verbal": "White has rooks on a1, h1; queens on d1; kings on e1; bishops on f1, e3; knights on g1, c3; pawns on a2, b2, c2, f2, g2, h2, d4, e4. Black has pawns on a6, d6, g6, b7, c7, e7, f7, h7; bishops on g7, c8; rooks on a8, h8; knights on b8, g8; queens on d8; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6"}
{"pos_id": 305, "position": "", "verbal": "White has rooks on a1, h1; queens on d1; kings on e1; bishops on f1, e3; pawns on a2, b2, c2, f2, g2, h2, d4, e4; knights on c3, f3. Black has pawns on a6, d6, g6, b7, c7, e7, f7, h7; bishops on g7, c8; rooks on a8, h8; knights on b8, g8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3"}
{"pos_id": 306, "position": "", "verbal": "White has rooks on a1, h1; queens on d1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, d4, e4; knights on c3, f3; bishops on d3, e3. Black has pawns on b5, a6, d6, g6, c7, e7, f7, h7; bishops on g7, c8; rooks on a8, h8; knights on b8, g8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3"}
{"pos_id": 307, "position": "", "verbal": "White has rooks on a1, h1; queens on d1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, d4, e4; knights on c3, f3; bishops on d3, e3. Black has pawns on b5, a6, d6, g6, c7, e7, f7, h7; bishops on b7, g7; rooks on a8, h8; knights on b8, g8; queens on d8; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7"}
{"pos_id": 308, "position": "", "verbal": "White has rooks on a1, h1; queens on d1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, d4, e4; knights on e2, f3; bishops on d3, e3. Black has pawns on b5, a6, d6, g6, c7, e7, f7, h7; bishops on b7, g7; rooks on a8, h8; knights on b8, g8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2"}
{"pos_id": 309, "position": "", "verbal": "White has rooks on a1, h1; queens on d1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, d4, e4; bishops on d3, e3; knights on f3, g3. Black has pawns on b5, a6, d6, g6, c7, e7, f7, h7; knights on f6, b8; bishops on b7, g7; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3"}
{"pos_id": 310, "position": "", "verbal": "White has rooks on a1, h1; queens on d1; kings on e1; pawns on a2, b2, c2, f2, g2, h2, d4, e4; bishops on d3, e3; knights on f3, g3. Black has pawns on b5, a6, d6, g6, c7, e7, f7, h7; knights on f6, d7; bishops on b7, g7; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7"}
{"pos_id": 311, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, c2, f2, g2, h2, d4, e4; bishops on d3, e3; knights on f3, g3. Black has pawns on b5, a6, d6, g6, c7, e7, f7, h7; knights on f6, d7; bishops on b7, g7; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O"}
{"pos_id": 312, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, f2, g2, h2, c3, d4, e4; bishops on d3, e3; knights on f3, g3. Black has pawns on b5, e5, a6, d6, g6, c7, f7, h7; knights on f6, d7; bishops on b7, g7; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3"}
{"pos_id": 313, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, f2, g2, c3, d4, e4, h4; bishops on d3, e3; knights on f3, g3. Black has pawns on b5, e5, h5, a6, d6, g6, c7, f7; knights on f6, d7; bishops on b7, g7; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4"}
{"pos_id": 314, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, f2, g2, c3, d4, e4, h4; bishops on d3, e3; knights on f3, g3. Black has knights on g4, d7; pawns on b5, e5, h5, a6, d6, g6, c7, f7; bishops on b7, g7; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4"}
{"pos_id": 315, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, f2, g2, c3, d4, e4, h4; bishops on d3, g5; knights on f3, g3. Black has knights on g4, d7; pawns on b5, e5, h5, a6, d6, g6, c7, f7; bishops on b7, g7; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5"}
{"pos_id": 316, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on a2, b2, f2, g2, c3, d4, e4, h4; bishops on d3, g5; knights on f3, g3. Black has knights on g4, d7; pawns on b5, e5, h5, a6, d6, g6, c7, f7; bishops on f6, b7; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6"}
{"pos_id": 317, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on b2, f2, g2, c3, a4, d4, e4, h4; bishops on d3, g5; knights on f3, g3. Black has knights on g4, d7; pawns on b5, e5, h5, a6, d6, g6, c7, f7; bishops on f6, b7; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4"}
{"pos_id": 318, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on b2, f2, g2, c3, d4, e4, h4; bishops on d3, g5; knights on f3, g3. Black has knights on g4, d7; pawns on b5, e5, h5, a6, d6, g6, f7; bishops on f6, b7; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5"}
{"pos_id": 319, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on b2, f2, g2, c4, d4, e4, h4; bishops on d3, g5; knights on f3, g3. Black has knights on g4, d7; pawns on b5, e5, h5, a6, d6, g6, f7; bishops on f6, b7; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4"}
{"pos_id": 320, "position": "", "verbal": "White has rooks on a1, f1; queens on d1; kings on g1; pawns on b2, f2, g2, d4, e4, h4; bishops on d3, g5; knights on f3, g3. Black has knights on g4, d7; pawns on b5, e5, h5, d6, g6, f7; bishops on f6, b7; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5"}
{"pos_id": 321, "position": "", "verbal": "White has queens on d1; rooks on f1; kings on g1; pawns on b2, f2, g2, d4, e4, g5; knights on f3, g3; bishops on b5. Black has knights on g4, d7; pawns on e5, h5, d6, g6, f7; bishops on a8; queens on d8; rooks on f8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5"}
{"pos_id": 322, "position": "", "verbal": "White has queens on d1; rooks on f1; kings on g1; pawns on b2, f2, g2, e4, g5; knights on f3, g3. Black has pawns on d4, h5, d6, g6, f7; knights on g4; queens on d7; bishops on a8; rooks on f8; kings on g8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7"}
{"pos_id": 323, "position": "", "verbal": "White has rooks on f1; kings on g1; pawns on b2, f2, g2, e4, g5; knights on f3, g3; queens on d4. Black has knights on g4; pawns on h5, d6, g6, f7; queens on d7; bishops on a8; rooks on f8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4"}
{"pos_id": 324, "position": "", "verbal": "White has rooks on f1; kings on g1; pawns on b2, f2, g2, e4, g5; knights on f3, g3; queens on d4. Black has knights on g4; pawns on h5, d6, g6, f7; queens on d7; bishops on a8; rooks on e8; kings on g8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8"}
{"pos_id": 325, "position": "", "verbal": "White has rooks on d1; kings on g1; pawns on b2, f2, g2, e4, g5; knights on f3, g3; queens on d4. Black has knights on g4; pawns on h5, d6, g6, f7; queens on d7; bishops on a8; rooks on e8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1"}
{"pos_id": 326, "position": "", "verbal": "White has rooks on d1; kings on g1; pawns on b2, f2, g2, e4, g5; knights on f3, g3; queens on d4. Black has knights on g4; queens on b5; pawns on h5, d6, g6, f7; bishops on a8; rooks on e8; kings on g8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5"}
{"pos_id": 327, "position": "", "verbal": "White has rooks on d1; pawns on b2, f2, g2, e4; kings on h2; knights on g3; queens on d4. Black has queens on g5; pawns on h5, d6, g6, f7; bishops on a8; rooks on e8; kings on g8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5"}
{"pos_id": 328, "position": "", "verbal": "White has rooks on d1; pawns on b2, f2, g2, e4; kings on h2; knights on g3; queens on d6. Black has queens on g5; pawns on h5, g6, f7; bishops on a8; rooks on e8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6"}
{"pos_id": 329, "position": "", "verbal": "White has rooks on d1; pawns on b2, f2, g2; kings on h2; knights on e3; queens on d6. Black has bishops on e4; pawns on h4, g6, f7; queens on g5; rooks on e8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3"}
{"pos_id": 330, "position": "", "verbal": "White has rooks on d1; pawns on b2, f2, g2; kings on h2; knights on e3; queens on d6. Black has pawns on h3, g6, f7; bishops on e4; queens on g5; rooks on e8; kings on g8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3"}
{"pos_id": 331, "position": "", "verbal": "White has rooks on d1; pawns on b2, f2, h3; kings on h2; knights on e3; queens on d6. Black has bishops on e4; queens on g5; pawns on g6, f7; rooks on e8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3"}
{"pos_id": 332, "position": "", "verbal": "White has rooks on d1; pawns on b2, f2, h3; kings on h2; knights on e3; queens on g3. Black has bishops on e4; queens on h5; pawns on g6, f7; rooks on e8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3"}
{"pos_id": 333, "position": "", "verbal": "White has rooks on d1; pawns on b2, f2, h3; kings on h2; knights on e3; queens on g3. Black has queens on e2; bishops on e4; pawns on g6, f7; rooks on e8; kings on g8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2"}
{"pos_id": 334, "position": "", "verbal": "White has pawns on b2, f2, h3; kings on h2; knights on e3; queens on g3; rooks on d4. Black has queens on e2; bishops on e4; pawns on g6, f7; rooks on e8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4"}
{"pos_id": 335, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; knights on e3; queens on g3; rooks on d4. Black has queens on b2; bishops on e4; pawns on g6, f7; rooks on e8; kings on g8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2"}
{"pos_id": 336, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; knights on e3; queens on g3; rooks on d7. Black has queens on b2; bishops on e4; pawns on g6, f7; rooks on e8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7"}
{"pos_id": 337, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; knights on e3; queens on g3; rooks on d7. Black has queens on b2; bishops on c6; pawns on g6, f7; rooks on e8; kings on g8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6"}
{"pos_id": 338, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; knights on e3; queens on g3; rooks on c7. Black has queens on b2; bishops on c6; pawns on g6, f7; rooks on e8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7"}
{"pos_id": 339, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; knights on e3; queens on f4; rooks on c7. Black has queens on b6; bishops on c6; pawns on g6, f7; rooks on e8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4"}
{"pos_id": 340, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; knights on e3; queens on d6; rooks on c7. Black has queens on b6; bishops on c6; pawns on g6, f7; rooks on f8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6"}
{"pos_id": 341, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; knights on e3; rooks on c6; queens on d6. Black has pawns on g6, f7; queens on b8; rooks on f8; kings on g8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6"}
{"pos_id": 342, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; knights on e3; rooks on c6; queens on d6. Black has pawns on g6, f7; queens on e8; rooks on f8; kings on g8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8"}
{"pos_id": 343, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; knights on g4; queens on g6. Black has queens on e6; pawns on f6; kings on e8; rooks on f8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+"}
{"pos_id": 344, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; knights on g4; queens on g6. Black has queens on e6; pawns on f6; rooks on f7; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7"}
{"pos_id": 345, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; queens on d3; knights on g4. Black has queens on e6; pawns on f6; rooks on f7; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3"}
{"pos_id": 346, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; queens on d3; knights on g4. Black has pawns on f6; queens on e7; rooks on f7; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7"}
{"pos_id": 347, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; queens on d3; knights on h6. Black has pawns on f6; queens on e7; rooks on f7; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6"}
{"pos_id": 348, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; queens on d3; knights on h6. Black has queens on e5; pawns on f6; rooks on f7; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+"}
{"pos_id": 349, "position": "", "verbal": "White has pawns on f2, h3; kings on h2; queens on g3; knights on h6. Black has queens on e5; pawns on f6; rooks on f7; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3"}
{"pos_id": 350, "position": "", "verbal": "White has kings on h2; pawns on g3, h3; knights on h6. Black has pawns on f6; rooks on f7; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3"}
{"pos_id": 351, "position": "", "verbal": "White has kings on h2; pawns on g3, h3; knights on h6. Black has pawns on f6; rooks on g7; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7"}
{"pos_id": 352, "position": "", "verbal": "White has kings on h2; pawns on g3, h3; knights on f5. Black has pawns on f6; rooks on g7; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5"}
{"pos_id": 353, "position": "", "verbal": "White has kings on h2; pawns on g3, h3; knights on f5. Black has pawns on f6; rooks on h7; kings on e8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7"}
{"pos_id": 354, "position": "", "verbal": "White has kings on g2; pawns on g3, h3; knights on f5. Black has pawns on f6; rooks on h7; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7 Kg2"}
{"pos_id": 355, "position": "", "verbal": "White has kings on f3; pawns on g3, h3; knights on f5. Black has pawns on f6; rooks on b7; kings on e8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7 Kg2 Rb7 Kf3"}
{"pos_id": 356, "position": "", "verbal": "White has kings on f3; pawns on g3, h3; knights on f5. Black has pawns on f6; rooks on b7; kings on d8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7 Kg2 Rb7 Kf3 Kd8"}
{"pos_id": 357, "position": "", "verbal": "White has pawns on g3, h3; kings on g4; knights on f5. Black has pawns on f6; rooks on b7; kings on d8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7 Kg2 Rb7 Kf3 Kd8 Kg4"}
{"pos_id": 358, "position": "", "verbal": "White has pawns on g3, h3; knights on f5; kings on h5. Black has rooks on b4; pawns on f6; kings on d8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7 Kg2 Rb7 Kf3 Kd8 Kg4 Rb4+ Kh5"}
{"pos_id": 359, "position": "", "verbal": "White has pawns on g3, h3; knights on f5; kings on h5. Black has rooks on b5; pawns on f6; kings on d8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7 Kg2 Rb7 Kf3 Kd8 Kg4 Rb4+ Kh5 Rb5"}
{"pos_id": 360, "position": "", "verbal": "White has pawns on g3, h3; knights on f5; kings on g6. Black has rooks on b5; pawns on f6; kings on d8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7 Kg2 Rb7 Kf3 Kd8 Kg4 Rb4+ Kh5 Rb5 Kg6"}
{"pos_id": 361, "position": "", "verbal": "White has pawns on g3, h3; knights on f5; kings on g6. Black has rooks on b6; pawns on f6; kings on d8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7 Kg2 Rb7 Kf3 Kd8 Kg4 Rb4+ Kh5 Rb5 Kg6 Rb6"}
{"pos_id": 362, "position": "", "verbal": "White has pawns on h3, g4; knights on f5; kings on g6. Black has rooks on b6; pawns on f6; kings on d8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7 Kg2 Rb7 Kf3 Kd8 Kg4 Rb4+ Kh5 Rb5 Kg6 Rb6 g4"}
{"pos_id": 363, "position": "", "verbal": "White has pawns on h3, g4; knights on f5; kings on g6. Black has pawns on f6; rooks on b7; kings on d8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7 Kg2 Rb7 Kf3 Kd8 Kg4 Rb4+ Kh5 Rb5 Kg6 Rb6 g4 Rb7"}
{"pos_id": 364, "position": "", "verbal": "White has pawns on g4, h4; knights on f5; kings on g6. Black has pawns on f6; rooks on b7; kings on d8. true.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7 Kg2 Rb7 Kf3 Kd8 Kg4 Rb4+ Kh5 Rb5 Kg6 Rb6 g4 Rb7 h4"}
{"pos_id": 365, "position": "", "verbal": "White has pawns on g4, h4; knights on f5; kings on g6. Black has pawns on f6; rooks on c7; kings on d8. false.", "move_history_copy": "e4 g6 d4 Bg7 Nc3 d6 Be3 a6 Nf3 b5 Bd3 Bb7 Ne2 Nf6 Ng3 Nbd7 O-O e5 c3 h5 h4 Ng4 Bg5 Bf6 a4 c6 axb5 cxb5 c4 O-O cxb5 axb5 Rxa8 Bxa8 Bxb5 Bxg5 hxg5 exd4 Bxd7 Qxd7 Qxd4 Re8 Rd1 Qb5 Nh2 Nxh2 Kxh2 Qxg5 Qxd6 h4 Nf1 Bxe4 Ne3 h3 gxh3 Qh5 Qg3 Qe2 Rd4 Qxb2 Rd7 Bc6 Rc7 Qb6 Qf4 Rf8 Qd6 Qb8 Rxc6 Qe8 Qf4 Qxc6 Ng4 Qe6 Nf6+ Kg7 Ng4 f6 Qh6+ Kf7 Qh7+ Ke8 Qxg6+ Rf7 Qd3 Qe7 Nh6 Qe5+ Qg3 Qxg3+ fxg3 Rg7 Nf5 Rh7 Kg2 Rb7 Kf3 Kd8 Kg4 Rb4+ Kh5 Rb5 Kg6 Rb6 g4 Rb7 h4 Rc7"}
{"pos_id": 366, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, d2, e2, f2, g2, h2. Black has pawns on a7, b7, c7, d7, e7, f7, g7, h7; rooks on a8, h8; knights on b8, g8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "Nf3"}
{"pos_id": 367, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, c2, d2, e2, f2, g2, h2. Black has knights on f6, b8; pawns on a7, b7, c7, d7, e7, f7, g7, h7; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "Nf3 Nf6"}
{"pos_id": 368, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, d2, e2, f2, g2, h2, c4. Black has knights on f6, b8; pawns on a7, b7, c7, d7, e7, f7, g7, h7; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "Nf3 Nf6 c4"}
{"pos_id": 369, "position": "", "verbal": "White has rooks on a1, h1; knights on b1, f3; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, d2, e2, f2, g2, h2, c4. Black has pawns on c5, a7, b7, d7, e7, f7, g7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "Nf3 Nf6 c4 c5"}
{"pos_id": 370, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, d2, e2, f2, g2, h2, c4; knights on c3, f3. Black has pawns on c5, a7, b7, d7, e7, f7, g7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3"}
{"pos_id": 371, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, d2, e2, f2, g2, h2, c4; knights on c3, f3. Black has pawns on c5, b6, a7, d7, e7, f7, g7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6"}
{"pos_id": 372, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, f1; queens on d1; kings on e1; pawns on a2, b2, d2, f2, g2, h2, c4, e4; knights on c3, f3. Black has pawns on c5, b6, a7, d7, e7, f7, g7, h7; knights on f6, b8; rooks on a8, h8; bishops on c8, f8; queens on d8; kings on e8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4"}
{"pos_id": 373, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, d3; queens on d1; kings on e1; pawns on a2, b2, d2, f2, g2, h2, c4, e4; knights on c3, f3. Black has pawns on c5, b6, a7, d7, e7, f7, g7, h7; knights on f6, b8; bishops on b7, f8; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3"}
{"pos_id": 374, "position": "", "verbal": "White has rooks on a1, h1; bishops on c1, d3; queens on d1; kings on e1; pawns on a2, b2, d2, f2, g2, h2, c4, e4; knights on c3, f3. Black has pawns on c5, b6, a7, d7, e7, f7, g7, h7; knights on c6, f6; bishops on b7, f8; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6"}
{"pos_id": 375, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1, d3; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2, c4, e4; knights on c3, f3. Black has pawns on c5, b6, a7, d7, e7, f7, g7, h7; knights on c6, f6; bishops on b7, f8; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O"}
{"pos_id": 376, "position": "", "verbal": "White has rooks on a1, f1; bishops on c1, d3; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2, c4, e4; knights on c3, f3. Black has pawns on c5, e5, b6, a7, d7, f7, g7, h7; knights on c6, f6; bishops on b7, f8; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5"}
{"pos_id": 377, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1, d3; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2, c4, e4; knights on c3, f3. Black has pawns on c5, e5, b6, a7, d7, f7, g7, h7; knights on c6, f6; bishops on b7, f8; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1"}
{"pos_id": 378, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1, d3; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2, c4, e4; knights on c3, f3. Black has pawns on c5, e5, b6, d6, a7, f7, g7, h7; knights on c6, f6; bishops on b7, f8; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6"}
{"pos_id": 379, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1, f1; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2, c4, e4; knights on c3, f3. Black has pawns on c5, e5, b6, d6, a7, f7, g7, h7; knights on c6, f6; bishops on b7, f8; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1"}
{"pos_id": 380, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1, f1; queens on d1; kings on g1; pawns on a2, b2, d2, f2, g2, h2, c4, e4; knights on c3, f3. Black has pawns on c5, e5, b6, d6, a7, f7, g7, h7; knights on c6, f6; bishops on b7, e7; rooks on a8, h8; queens on d8; kings on e8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7"}
{"pos_id": 381, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1, f1; queens on d1; kings on g1; pawns on a2, b2, f2, g2, h2, d3, c4, e4; knights on c3, f3. Black has pawns on c5, e5, b6, d6, a7, f7, g7, h7; knights on c6, f6; bishops on b7, e7; rooks on a8, h8; queens on d8; kings on e8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3"}
{"pos_id": 382, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1, f1; queens on d1; kings on g1; pawns on a2, b2, f2, g2, h2, d3, c4, e4; knights on c3, f3. Black has pawns on c5, e5, b6, d6, a7, f7, g7, h7; knights on c6, f6; bishops on b7, e7; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O"}
{"pos_id": 383, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1, f1; queens on d1; kings on g1; pawns on a2, b2, f2, h2, d3, g3, c4, e4; knights on c3, f3. Black has pawns on c5, e5, b6, d6, a7, f7, g7, h7; knights on c6, f6; bishops on b7, e7; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3"}
{"pos_id": 384, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1, f1; queens on d1; kings on g1; pawns on a2, b2, f2, h2, d3, g3, c4, e4; knights on c3, f3. Black has knights on d4, f6; pawns on c5, e5, b6, d6, a7, f7, g7, h7; bishops on b7, e7; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4"}
{"pos_id": 385, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1, f1; queens on d1; kings on g1; pawns on a2, b2, f2, h2, d3, g3, c4, e4; knights on e2. Black has pawns on d4, e5, b6, d6, a7, f7, g7, h7; knights on f6; bishops on b7, e7; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2"}
{"pos_id": 386, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1, f1; queens on d1; kings on g1; pawns on a2, b2, f2, h2, d3, g3, c4, e4; knights on e2. Black has pawns on d4, e5, b6, d6, a7, f7, g7, h7; bishops on b7, e7; knights on d7; rooks on a8, f8; queens on d8; kings on g8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7"}
{"pos_id": 387, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1, g2; queens on d1; kings on g1; pawns on a2, b2, f2, h2, d3, g3, c4, e4; knights on e2. Black has pawns on d4, e5, b6, d6, a7, f7, g7, h7; bishops on b7, e7; knights on d7; rooks on a8, f8; queens on d8; kings on g8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2"}
{"pos_id": 388, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1; queens on d1; pawns on a2, b2, f2, h2, d3, g3, c4; knights on e2; kings on g2. Black has pawns on d4, e5, b6, d6, a7, g7, h7; rooks on f5, a8; knights on d7; bishops on e7; queens on d8; kings on g8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5"}
{"pos_id": 389, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1; queens on d1; pawns on a2, b2, f2, h2, d3, c4, g4; knights on e2; kings on g2. Black has pawns on d4, e5, b6, d6, a7, g7, h7; rooks on f5, a8; knights on d7; bishops on e7; queens on d8; kings on g8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4"}
{"pos_id": 390, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1; queens on d1; pawns on a2, b2, f2, h2, d3, c4, g4; knights on e2; kings on g2. Black has pawns on d4, e5, b6, d6, a7, g7, h7; knights on d7; bishops on e7; rooks on f7, a8; queens on d8; kings on g8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7"}
{"pos_id": 391, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1; queens on d1; pawns on a2, b2, f2, h2, d3, c4, g4; kings on g2; knights on e4. Black has pawns on d4, e5, b6, d6, a7, g7, h7; knights on c5; queens on d7; bishops on e7; rooks on f7, a8; kings on g8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7"}
{"pos_id": 392, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1; queens on d1; pawns on a2, b2, f2, h2, d3, c4, g4; kings on g2. Black has pawns on d4, c5, e5, d6, a7, g7, h7; queens on d7; bishops on e7; rooks on f7, a8; kings on g8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5"}
{"pos_id": 393, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1; queens on d1; pawns on a2, b2, h2, d3, c4, f4, g4; kings on g2. Black has pawns on d4, c5, e5, d6, a7, g7, h7; queens on d7; bishops on e7; rooks on f7, a8; kings on g8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5 f4"}
{"pos_id": 394, "position": "", "verbal": "White has rooks on a1, e1; bishops on c1; pawns on a2, b2, h2, d3, c4, g4; kings on g2; queens on f3. Black has pawns on d4, f4, c5, d6, a7, g7, h7; queens on d7; bishops on e7; rooks on f7, b8; kings on g8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5 f4 exf4 Qf3 Rb8"}
{"pos_id": 395, "position": "", "verbal": "White has rooks on a1, e4; bishops on c1; pawns on a2, h2, b3, d3, c4, h5; kings on g2; queens on f3. Black has pawns on d4, f4, c5, d6, a7, g7; bishops on h4; queens on d7; rooks on f7, b8; kings on g8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5 f4 exf4 Qf3 Rb8 b3 Bh4 Re4 h5 gxh5"}
{"pos_id": 396, "position": "", "verbal": "White has rooks on a1, e4; bishops on c1; pawns on a2, h2, b3, d3, c4, h5; kings on g2; queens on f3. Black has pawns on d4, f4, c5, d6, a7, g7; bishops on h4; queens on d7; rooks on f7, f8; kings on g8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5 f4 exf4 Qf3 Rb8 b3 Bh4 Re4 h5 gxh5 Rbf8"}
{"pos_id": 397, "position": "", "verbal": "White has rooks on a1, e4; pawns on a2, h2, b3, d3, c4, h5; bishops on d2; kings on g2; queens on f3. Black has pawns on d4, f4, c5, d6, a7, g7; bishops on h4; queens on d7; rooks on f7, f8; kings on g8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5 f4 exf4 Qf3 Rb8 b3 Bh4 Re4 h5 gxh5 Rbf8 Bd2"}
{"pos_id": 398, "position": "", "verbal": "White has rooks on a1, e4; pawns on a2, h2, b3, d3, c4, h5; bishops on d2; kings on g2; queens on f3. Black has pawns on d4, f4, c5, d6, a7, g7; bishops on h4; queens on f5; rooks on f7, f8; kings on g8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5 f4 exf4 Qf3 Rb8 b3 Bh4 Re4 h5 gxh5 Rbf8 Bd2 Qf5"}
{"pos_id": 399, "position": "", "verbal": "White has rooks on f1, e4; kings on h1; pawns on a2, h2, b3, d3, c4, h5; bishops on d2; queens on f3. Black has pawns on d4, f4, a5, c5, d6, g7; bishops on h4; queens on f5; rooks on f7, f8; kings on g8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5 f4 exf4 Qf3 Rb8 b3 Bh4 Re4 h5 gxh5 Rbf8 Bd2 Qf5 Rf1 a5 Kh1"}
{"pos_id": 400, "position": "", "verbal": "White has rooks on g1, e4; kings on h1; pawns on a2, h2, b3, d3, c4, h5; bishops on d2; queens on f3. Black has pawns on d4, f4, a5, c5, d6, g7; bishops on h4; queens on g5; rooks on f7, f8; kings on g8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5 f4 exf4 Qf3 Rb8 b3 Bh4 Re4 h5 gxh5 Rbf8 Bd2 Qf5 Rf1 a5 Kh1 Qg5 Rg1"}
{"pos_id": 401, "position": "", "verbal": "White has kings on h1; pawns on a2, h2, b3, d3, c4, h5; bishops on d2; queens on f3; rooks on e4, d6. Black has pawns on d4, f4, a5, c5, g7; queens on f5; bishops on g5; rooks on f7, f8; kings on g8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5 f4 exf4 Qf3 Rb8 b3 Bh4 Re4 h5 gxh5 Rbf8 Bd2 Qf5 Rf1 a5 Kh1 Qg5 Rg1 Qf5 Rg6 Bg5 Rxd6"}
{"pos_id": 402, "position": "", "verbal": "White has kings on h1; pawns on a2, h2, d3, a4, c4, h5; bishops on d2; queens on f3; rooks on e4, d5. Black has pawns on d4, f4, c5, g7; queens on f6; bishops on h6; rooks on f7, f8; kings on g8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5 f4 exf4 Qf3 Rb8 b3 Bh4 Re4 h5 gxh5 Rbf8 Bd2 Qf5 Rf1 a5 Kh1 Qg5 Rg1 Qf5 Rg6 Bg5 Rxd6 a4 Rd5 Qf6 bxa4 Bh6"}
{"pos_id": 403, "position": "", "verbal": "White has kings on h1; pawns on a2, h2, d3, a4, c4, h5; bishops on d2; queens on f3; rooks on e4, b5. Black has pawns on d4, f4, g7; queens on b6; bishops on h6; rooks on f7, f8; kings on g8. true.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5 f4 exf4 Qf3 Rb8 b3 Bh4 Re4 h5 gxh5 Rbf8 Bd2 Qf5 Rf1 a5 Kh1 Qg5 Rg1 Qf5 Rg6 Bg5 Rxd6 a4 Rd5 Qf6 bxa4 Bh6 Rxc5 Qb6 Rb5"}
{"pos_id": 404, "position": "", "verbal": "White has kings on h1; pawns on a2, h2, d3, c4, h5, a6; bishops on d2; queens on f3; rooks on e4, b6. Black has pawns on d4, f4, g7; bishops on h6; rooks on e7, e8; queens on a8; kings on g8. false.", "move_history_copy": "Nf3 Nf6 c4 c5 Nc3 b6 e4 Bb7 Bd3 Nc6 O-O e5 Re1 d6 Bf1 Be7 d3 O-O g3 Nd4 Nxd4 cxd4 Ne2 Nd7 Bg2 f5 exf5 Bxg2 Kxg2 Rxf5 g4 Rf7 Ng3 Nc5 Ne4 Qd7 Nxc5 bxc5 f4 exf4 Qf3 Rb8 b3 Bh4 Re4 h5 gxh5 Rbf8 Bd2 Qf5 Rf1 a5 Kh1 Qg5 Rg1 Qf5 Rg6 Bg5 Rxd6 a4 Rd5 Qf6 bxa4 Bh6 Rxc5 Qb6 Rb5 Qc6 a5 Re7 Rb6 Qa8 a6 Rfe8"}